{
  "ALG": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%88%d0%bb%d1%8e%d0%b7%d0%b0-%d1%83%d1%80%d0%be%d0%b2%d0%bd%d1%8f-%d0%bf%d1%80%d0%b8%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Обеспечивает поддержку стороннего протокола для общего доступа к подключению к Интернету",
    "explained": "Служба, позволяющая получать интернет на устройство, подключённое к вашему компьютеру. Например, у вас 2 компьютера, один из которых ноутбук, в котором нет LAN-портов (ультрабук). Также у вас нет роутера (маршрутизатора) и вы не знаете, как получить интернет ноутбуку. Есть служба, которая позволит получить интернет от основного компьютера.",
    "recommendation": "Учитывая следующее:\nСлужба потеряла свою актуальность ещё на Windows 7\nМожете отключить службу."
  },
  "AppIDSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%b4%d0%be%d1%81%d1%82%d0%be%d0%b2%d0%b5%d1%80%d0%b5%d0%bd%d0%b8%d0%b5-%d0%bf%d1%80%d0%b8%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Определяет и проверяет удостоверение приложения. Отключение данной службы делает невозможным принудительное применение политики AppLocker.",
    "explained": "Служба позволяет создавать правила-ограничения для запуска программ и приложений. Руководит этими правилами, как система, так и пользователь. Если любите танцевать с бубном, добро пожаловать в Google по запросу AppLocker в Windows.",
    "recommendation": "Учитывая следующее:\nСлужба запускается только по требованию\nСлужбу можно оставить Вручную.\nОтключение службы сделает невозможным ограничивать права на запуск программ и приложений."
  },
  "Appinfo": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b2%d0%b5%d0%b4%d0%b5%d0%bd%d0%b8%d1%8f-%d0%be-%d0%bf%d1%80%d0%b8%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d0%b8",
    "description": "Обеспечивает выполнение интерактивных приложений с дополнительными административными привилегиями. Если эта служба будет остановлена, пользователи не смогут запускать приложения с дополнительными административными привилегиями, которые могут потребоваться для выполнения нужных пользовательских заданий.",
    "explained": "Служба, позволяющая пользователям без привилегий получать доступ к запуску / выполнению служб / программ с административными привилегиями.",
    "recommendation": "Учитывая следующее:\nОтключение службы приведёт к невозможности запускать простому пользователю даже само окно Службы\nЕсли вы не хотите видеть подобные ошибки\nСлужбу нельзя отключать."
  },
  "AppMgmt": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d0%b5-%d0%bf%d1%80%d0%b8%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f%d0%bc%d0%b8",
    "description": "Обработка запросов на установку, удаление и построение списков для программ, установленных через групповую политику. При отключении этой службы пользователи не смогут устанавливать, удалять и создавать списки программ, установленных через групповую политику. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Служба, использующаяся на предприятиях с огромным количеством компьютеров, где необходима установка программ здесь и сейчас, сразу и всем. Осуществляется с помощью следующего танца с бубнами.",
    "recommendation": "Учитывая следующее:\nСлужба бессмысленна в домашнем использовании\nМожете отключить службу."
  },
  "GoogleChromeElevationService": {
    "error": true,
    "message": "Not found"
  },
  "UnistoreSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "UserDataSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "WpnUserService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "AssignedAccessManagerSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-assignedaccessmanager",
    "description": "Служба AssignedAccessManager поддерживает интерфейс терминала в Windows.",
    "explained": "Служба, необходимая для создания Windows Киоска. Запускается служба лишь в тот момент, когда вы создаёте учётку Киоска и прекращает свою работу через несколько секунд. Стоит отметить, что несмотря на отсутствующие зависимости, у службы они ещё как есть. Причём даже обратные зависимости. Windows Киоск не будет работать, если вы не включите службы Пользовательская служба push-уведомлений Windows (иначе получите ошибку 0x80004002) и Готовность приложений (иначе получите ошибку 0x80073d23). Также, для Windows Киоска необходим включённый Контроль учётных записей (UAC).",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Windows Киоск\nМожете отключить службу.\nОтключение этой службы приведёт к тому, что при создании Киоска вы увидите ошибку."
  },
  "vmicrdv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d1%80%d0%b0%d0%b1%d0%be%d1%87%d0%b8%d1%85-%d1%81%d1%82%d0%be%d0%bb%d0%be%d0%b2-hyper-v",
    "description": "Эта служба предоставляет платформу для обмена данными между виртуальной машиной и операционной системой физического компьютера.",
    "explained": "Служба, поддерживающая работу виртуальной машины Microsoft на аппаратном уровне.",
    "recommendation": "Учитывая следующее:\nРядовому и даже опытному пользователю давно открылись Oracle VirtualBox и VMware Workstation\nСлужбу можно отключить."
  },
  "Netlogon": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b5%d1%82%d0%b5%d0%b2%d0%be%d0%b9-%d0%b2%d1%85%d0%be%d0%b4-%d0%b2-%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d1%83",
    "description": "Обеспечивает безопасный канал связи между этим компьютером и контроллером домена для проверки подлинности пользователей и служб. Если эта служба остановлена, компьютер может быть неспособен проверять подлинность пользователей и служб и контроллер домена не может регистрировать DNS-записи. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Служба, необходимая для контроля доступа серверных участников локальной сети.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете локальную сеть\nили используете простую домашнюю локальную сеть для Общего доступа\nЕсли локальная сеть уже настроена\nМожете отключить службу."
  },
  "GoogleUpdaterInternalService131.0.6776.0": {
    "error": true,
    "message": "Not found"
  },
  "DmEnrollmentSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%80%d0%b5%d0%b3%d0%b8%d1%81%d1%82%d1%80%d0%b0%d1%86%d0%b8%d0%b8-%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-dmenrollmentsvc",
    "description": "Выполняет действия по регистрации устройства для управления устройством",
    "explained": "Служба, необходимая для развёртывания оффлайн обновлений Windows.",
    "recommendation": "Учитывая следующее:\nЕсли вы не устанавливаете обновления Windows\nМожете отключить службу."
  },
  "GoogleUpdaterInternalService134.0.6985.0": {
    "error": true,
    "message": "Not found"
  },
  "PeerDistSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/branchcache",
    "description": "Эта служба кэширует сетевое содержимое, полученное от кэширующих узлов локальной подсети.",
    "explained": "Если вы используете локальную сеть и часто по ней шаритесь или что-то передаёте, служба BranchCache занимается кэшированием этих сетевых данных, чтобы ускорить доступ к просмотру и другим операциям: копирование, перемещение, запуск программ и прочее. Если с сетью что-то случится, вы можете предположить, что BranchCache даст вам закэшированные данные. А вот и нет.  BranchCache не даст кэшируемые данные, т.к. на другом конце связи, возможно, эти данные канули в LAN-сетей, но при своей работе нехило так снижает нагрузку на лету. Поэтому, перед тем как предоставить вам доступ к данным, система BranchCache проверяет актуальность этих данных, которые вы собираетесь смотреть и трогать. И только после успешной проверки даёт добро.",
    "recommendation": "Учитывая следующее:\nДругие службы не зависят от этой службы\nПо умолчанию тип запуска установлен на Вручную\nМожно не обращать внимания на эту службу. Сама по себе она не включается и не расходует ресурсы компьютера.\n...но если очень хочется, то можно выключить."
  },
  "ApxSvc": {
    "error": true,
    "message": "Not found"
  },
  "PcaSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%be%d0%bc%d0%be%d1%89%d0%bd%d0%b8%d0%ba%d0%b0-%d0%bf%d0%be-%d1%81%d0%be%d0%b2%d0%bc%d0%b5%d1%81%d1%82%d0%b8%d0%bc%d0%be%d1%81%d1%82%d0%b8-pcasvc",
    "description": "Обеспечивает поддержку помощника по совместимости программ. Он следит за программами, устанавливаемыми и запускаемыми пользователем, и обнаруживает известные проблемы, связанные с совместимостью. Если остановить данную службу, то помощник по совместимости программ будет работать неправильно.",
    "explained": "Служба, позволяющая запускать старые программы на новейших версиях Windows. Бывают такие программы, разрабы которых уже более 10 лет ничего не обновляют и есть вероятность, что они адаптированы под системные каталоги и пути реестра для старых версий Windows. Во время запуска старых программ в режиме совместимости, служба позволяет предопределить требуемую операционную систему и работать в той среде, которая необходима программе. Даже, если программа не может что-то сделать и Windows не может найти для программы файлы, папки или пути реестра, ошибки всё равно не будет и Windows будет пытаться сделать всё, чтобы программа так или иначе запустилась и работала.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете программы, авторы которых забили на свои продукты более, чем на 10 лет\nМожете отключить службу."
  },
  "autotimesvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b2%d1%80%d0%b5%d0%bc%d1%8f-%d0%b2-%d1%81%d0%b5%d1%82%d0%b8-%d0%bc%d0%be%d0%b1%d0%b8%d0%bb%d1%8c%d0%bd%d0%be%d0%b9-%d1%81%d0%b2%d1%8f%d0%b7%d0%b8",
    "description": "Эта служба устанавливает время на основе сообщений службы NITZ, получаемых из сети мобильной связи",
    "explained": "Служба, дополнительно проверяющая вашу временную зону на основе данных полученных с подключенного к компу телефона.",
    "recommendation": "Учитывая следующее:\nОт службы не зависят другие службы\nСлужбу можно отключить или оставить Вручную. Без подключения телефона к компьютеру служба сама не запускается."
  },
  "edgeupdatem": {
    "error": true,
    "message": "Not found"
  },
  "ClipSVC": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bb%d0%b8%d1%86%d0%b5%d0%bd%d0%b7%d0%b8%d0%b9-%d0%ba%d0%bb%d0%b8%d0%b5%d0%bd%d1%82%d0%b0-clipsvc",
    "description": "Обеспечивает поддержку инфраструктуры для Microsoft Store. Эта служба запускается по требованию, и при ее отключении приложения, приобретенные с помощью Магазина Windows, не будут работать правильно.",
    "explained": "Служба, проверяющая лицензию плиточных приложений в момент их первой загрузки из Магазина Windows. Данная служба также отвечает за восстановление удалённых приложений.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь Магазином Windows\nМожете отключить службу.Отключение службы не позволит скачивать приложения из Магазина Windows, потому что на этапе загрузки, сразу же, будет ошибка 0xC0020036, говорящая о том, что нужно включить службу Оптимизации доставки. Хотя на самом деле дело не в ней, а в службе лицензий клиента (ClipSVC).\nТакже отключение службы не позволит устанавливать / восстанавливать оффлайн приложения."
  },
  "nsi": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%84%d0%b8%d0%bb%d1%8c%d1%82%d1%80%d0%b0%d1%86%d0%b8%d1%8f-%d0%ba%d0%bb%d0%b0%d0%b2%d0%b8%d0%b0%d1%82%d1%83%d1%80%d1%8b-microsoft-mskeyboardfilter",
    "description": "Управляет фильтрацией и сопоставлением нажатий клавиш",
    "explained": "Служба, которая позволяет отказаться от любых горячих клавиш, заложенных в Windows 10 и выше.",
    "recommendation": "Учитывая следующее:\nСлужба и так не работает\nСлужбу можно не трогать."
  },
  "DevicesFlowUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "NPSMSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "DoSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%be%d0%bf%d1%82%d0%b8%d0%bc%d0%b8%d0%b7%d0%b0%d1%86%d0%b8%d1%8f-%d0%b4%d0%be%d1%81%d1%82%d0%b0%d0%b2%d0%ba%d0%b8",
    "description": "Выполнение задач по оптимизации доставки содержимого",
    "explained": "Служба, позволяющая скачивать обновления Windows и приложения из Магазина Windows не с одного сервера, а сразу с нескольких.",
    "recommendation": "Учитывая следующее:\nНа скорость загрузки обновлений и приложений это почти никак не влияет\nОбновления – зло\nСлужбу нужно отключить Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\DoSvc /v Start /t reg_dword /d 4 /f"
  },
  "SCPolicySvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%be%d0%bb%d0%b8%d1%82%d0%b8%d0%ba%d0%b0-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-%d1%81%d0%bc%d0%b0%d1%80%d1%82-%d0%ba%d0%b0%d1%80%d1%82",
    "description": "Позволяет настроить систему так, чтобы рабочий стол блокировался при извлечении смарт-карты.",
    "explained": "Служба, позволяющая блокировать Рабочий стол при извлечении смарт-карты.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете смарт-карты\nМожете отключить службу."
  },
  "TermService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d1%80%d0%b0%d0%b1%d0%be%d1%87%d0%b8%d1%85-%d1%81%d1%82%d0%be%d0%bb%d0%be%d0%b2",
    "description": "Разрешает пользователям интерактивное подключение к удаленному компьютеру. Удаленный рабочий стол и сервер, обслуживающий сеансы подключения к удаленному рабочему столу, зависят от данной службы. Чтобы запретить удаленное использование данного компьютера, необходимо открыть панель управления, дважды щелкнуть компонент \"Свойства системы\" и затем на вкладке \"Удаленный доступ\" снять соответствующие флажки.",
    "explained": "Главная служба, отвечающая за удалённое управление рабочим столом.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь удалённым рабочим столом\nили пользуетесь, но подключаться будете только вы (не нужно, чтобы к вам)\nМожете отключить службу.\nЭто также отключит Перенаправитель портов, который вашему главному компьютеру тоже ни к чему."
  },
  "icssvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-windows-mobile-hotspot",
    "description": "Позволяет использовать соединение для передачи данных на другом устройстве.",
    "explained": "Служба, позволяющая создавать точку доступа.",
    "recommendation": "Учитывая следующее:\nЕсли вы не собираетесь раздавать интернет именно со своего устройства (настольный ПК или ноутбук)\nМожете отключить службу.\nОтключение службы не позволит использовать переключатель точки доступа"
  },
  "DevQueryBroker": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b1%d1%80%d0%be%d0%ba%d0%b5%d1%80-%d1%84%d0%be%d0%bd%d0%be%d0%b2%d0%be%d0%b3%d0%be-%d0%be%d0%b1%d0%bd%d0%b0%d1%80%d1%83%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f-devquery",
    "description": "Позволяет приложениям обнаруживать устройства с фоновой задачей",
    "explained": "Служба нужна для устройств с поддержкой фоновой работы.",
    "recommendation": "Учитывая следующее:\nУ вас нет устройств с поддержкой фоновой работы\nСлужба не зависит от других служб\nДругие службы не зависят от этой службы\nСлужбу можно отключить."
  },
  "wscsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%86%d0%b5%d0%bd%d1%82%d1%80-%d0%be%d0%b1%d0%b5%d1%81%d0%bf%d0%b5%d1%87%d0%b5%d0%bd%d0%b8%d1%8f-%d0%b1%d0%b5%d0%b7%d0%be%d0%bf%d0%b0%d1%81%d0%bd%d0%be%d1%81%d1%82%d0%b8",
    "description": "Служба WSCSVC (центр безопасности Windows) следит за параметрами работоспособности системы безопасности и протоколирует их. В эти параметры входит состояние брандмауэра (включен или выключен), антивирусной программы (включена/выключена/устарела), антишпионской программы (включена/выключена/устарела), обновления Windows (автоматическая или ручная загрузка и установка обновлений), контроля учетных записей пользователей (включен или выключен) и параметры Интернета (рекомендованные или отличающиеся от рекомендованных). Служба предоставляет интерфейсы API COM для независимых поставщиков программных продуктов, позволяющие поставщикам налаживать взаимодействие своих продуктов со службой центра безопасности (регистрация и запись состояний продуктов). Пользовательский интерфейс компонента \"Безопасность и обслуживание\" использует эту службу для отображения предупреждений в панели задач и предоставления графического отображения состояний работоспособности системы безопасности в панели управления компонента \"Безопасность и обслуживание\". Защита доступа к сети (NAP) использует данную службу для протоколирования состояний работоспособности системы безопасности клиентов и передачи их на сервер политики сети NAP с целью принятия решений о помещении в карантин. У данной службы также есть публичный API, позволяющий внешним потребителям программно получать сводные данные о состоянии работоспособности системы безопасности.",
    "explained": "Служба, якобы следящая за безопасностью Windows, на самом деле следящая за включённым состоянием всех Защитников, SmartScreen и прочей ереси, а также информирующая о том, что компьютер небезопасно использовать без плацебо от Microsoft.",
    "recommendation": "Учитывая следующее:\nЕсли вы в состоянии сами себя защищать без красненьких табличек-пугалочек\nМожете отключить службу с помощью супердоступа в Win 10 Tweaker Командой:\ncmd.exe /c sc config wscsvc start=disabled & sc stop wscsvc"
  },
  "NcdAutoSetup": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%81%d0%bf%d0%b8%d1%81%d0%ba%d0%b0-%d1%81%d0%b5%d1%82%d0%b5%d0%b9",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "StiSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b7%d0%b0%d0%b3%d1%80%d1%83%d0%b7%d0%ba%d0%b8-%d0%b8%d0%b7%d0%be%d0%b1%d1%80%d0%b0%d0%b6%d0%b5%d0%bd%d0%b8%d0%b9-windows-wia",
    "description": "Обеспечивает службы получения изображений со сканеров и цифровых камер",
    "explained": "Служба, определяющая наличие сканера и цифрового фотоаппарата.",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет сканера\nЕсли данные с цифрового фотоаппарата вам удобнее извлекать по старинке в проводнике \nМожете отключить службу."
  },
  "hidserv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%be%d1%81%d1%82%d1%83%d0%bf-%d0%ba-hid-%d1%83%d1%81%d1%82%d1%80%d0%be%d0%b9%d1%81%d1%82%d0%b2%d0%b0%d0%bc",
    "description": "Активирует и поддерживает использование клавиш быстрого вызова на клавиатурах, пультов дистанционного управления и других устройств мультимедиа. Отключение этой службы не рекомендуется.",
    "explained": "Служба, которая запускается при обнаружении мультимедийных клавиатур, мышей, клавиатур с дополнительными клавишами, а также устройств с возможностью посылать сложные команды.",
    "recommendation": "Учитывая следующее:\nОт этой службы зависят все современные клавиатуры и мыши\n(обработка дополнительных кнопок)\nСлужбу не рекомендуется отключать. Даже если на вашей клавиатуре всего 4 дополнительные кнопки, регулирующие громкость, служба окажется нужна."
  },
  "edgeupdate": {
    "error": true,
    "message": "Not found"
  },
  "Wecsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b1%d0%be%d1%80%d1%89%d0%b8%d0%ba-%d1%81%d0%be%d0%b1%d1%8b%d1%82%d0%b8%d0%b9-windows",
    "description": "Эта служба управляет постоянными подписками на события от удаленных источников, поддерживающих протокол WS-Management. Сюда входят журналы событий Windows Vista, оборудование, а также источники с интерфейсом IPMI. Эта служба хранит пересылаемые события в локальном журнале событий. Если эта служба остановлена или отключена, подписки на события не могут быть созданы и отправленные события не могут быть приняты.",
    "explained": "Серверная служба, собирающая журналы событий Windows с компьютеров локальной сети.",
    "recommendation": "Учитывая следующее:\nЕсли у вас домашняя сеть\nМожете отключить службу."
  },
  "CscService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b0%d0%b2%d1%82%d0%be%d0%bd%d0%be%d0%bc%d0%bd%d1%8b%d0%b5-%d1%84%d0%b0%d0%b9%d0%bb%d1%8b",
    "description": "Служба автономных файлов выполняет работу по обслуживанию кэша автономных файлов, отвечает на события входа пользователя в систему и выхода его из системы, реализует свойства общих API и отсылает интересующимся работой автономных файлов и изменениями состояния кэша те события, которые им интересны.",
    "explained": "Служба, занимающаяся кэшированием файлов, которые вы используете в Общем доступе по локальной сети, а также отображением этих файлов, если внезапно падает сеть.",
    "recommendation": "Учитывая следующее:\nСлужба включается только тогда, когда требуется\nМожно оставить тип запуска Вручную.\nНо если вы:\nХотите пользоваться только актуальными данными в Общем доступе\nНе хотите, чтобы данные локальной сети кэшировались и мусорили в системе\nМожете отключить эту службу."
  },
  "WSearch": {
    "url": "https://win10tweaker.ru/twikinarium/services/windows-search",
    "description": "Индексирование контента, кэширование свойств и результатов поиска для файлов, электронной почты и другого контента.",
    "explained": "Windows Search постоянно индексирует содержимое дисков, чтобы, в случае вашего Поиска по системе, результаты поиска отображались быстрее.",
    "recommendation": "Учитывая следующее:\nСлужба постоянно индексирует диски\nУгробит HDD / SSD быстрее за счёт постоянного индексирования файлов\nВы не используете функцию История файлов\nРекомендуется отключить эту службу."
  },
  "Start11": {
    "error": true,
    "message": "Not found"
  },
  "lltdsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%82%d0%be%d0%bf%d0%be%d0%bb%d0%be%d0%b3-%d0%ba%d0%b0%d0%bd%d0%b0%d0%bb%d1%8c%d0%bd%d0%be%d0%b3%d0%be-%d1%83%d1%80%d0%be%d0%b2%d0%bd%d1%8f",
    "description": "Создает карту сети, содержащую сведения о топологии компьютеров и устройств (подключений), а также метаданные, описывающие каждый компьютер и устройство. Если эта служба отключена, карта сети будет работать неправильно.",
    "explained": "Служба, создающая карту локальных сетей, чтобы группы этих самых локальных сетей не были вперемешку, используя при этом драйвер для вычисления пропускной способности.",
    "recommendation": "Можете отключить службу, но не отключайте драйверы тополога в свойствах подключения, иначе это не позволит сделать из Общественной сети Частную."
  },
  "PrintScanBrokerService": {
    "error": true,
    "message": "Not found"
  },
  "FrameServerMonitor": {
    "error": true,
    "message": "Not found"
  },
  "lfsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b3%d0%b5%d0%be%d0%b3%d1%80%d0%b0%d1%84%d0%b8%d1%87%d0%b5%d1%81%d0%ba%d0%be%d0%b3%d0%be-%d0%bf%d0%be%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Эта служба отслеживает местоположение системы и управляет геозонами (географическими расположениями, с которыми сопоставлены события). Если отключить эту службу, приложения не смогут получать и использовать уведомления для географического положения и геозон.",
    "explained": "Служба, определяющая ваше местоположение по ГЛОНАСС, GPS и IP.",
    "recommendation": "Учитывая следующее:\nЕсли у вас настольный компьютер\nили ноутбук / планшет, которые не нужно географически определять\nРекомендуется отключить службу."
  },
  "SDRSVC": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d1%80%d0%be%d0%b3%d1%80%d0%b0%d0%bc%d0%bc%d0%b0-%d0%b0%d1%80%d1%85%d0%b8%d0%b2%d0%b0%d1%86%d0%b8%d0%b8-%d0%b4%d0%b0%d0%bd%d0%bd%d1%8b%d1%85",
    "description": "Обеспечивает функции архивации и восстановления Windows.",
    "explained": "Служба-программа архивации и восстановления Windows. Указание на Windows 7 в названии сервиса говорит о том, что служба поддерживается всеми операционными системами, начиная от Windows 7, а не только Windows 7. Формально, у службы нет зависимостей, однако, если вы отключите Теневое копирование тома, то служба не сможет создать Образ системы. А если отключите Программный поставщик теневого копирования (Microsoft) и/или Службу модуля архивации на уровне блоков, то во время архивации Образа системы вы увидите ошибку 0x80042302, либо 0x80070422 и/или ошибку VSS и SPP.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете архивацию и восстановление Windows\nЕсли вы используете Acronis True Image\nМожете отключить службу.Помните – не все программы являются аналогами Acronis True Image.\nБольшинство бесплатных альтернатив Acronis True Image работают с помощью теневого копирования, а значит им нужны все 5 служб:\nПрограмма архивации данных\nПрограммный поставщик теневого копирования (Microsoft)\nТеневое копирование тома\nСлужба модуля архивации на уровне блоков\nРабочая станция"
  },
  "FontCache": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%ba%d1%8d%d1%88-%d1%88%d1%80%d0%b8%d1%84%d1%82%d0%be%d0%b2-windows-presentation-foundation-3-0-0-0",
    "description": "Оптимизирует производительность приложений Windows Presentation Foundation (WPF) путем кэширования обычно используемых данных шрифтов. Приложения WPF запускают эту службу, если она еще не запущена. Ее можно отключить, однако это ухудшит производительность приложений WPF.",
    "explained": "Служба, которая запускается лишь в том случае, если запускаемое WPF-приложение имеет нестандартные шрифты. Эта служба кэширует эти шрифты, чтобы быстрее загружалось приложение. Идея так себе, потому что в эру SSD насилуется накопитель, а оперативной памяти точно хватит, чтобы быстро и красиво всё запустить и отобразить.",
    "recommendation": "Учитывая следующее:\nСлужба запускается крайне редко\nПо умолчанию тип запуска установлен на Вручную\nМожно не обращать внимания на эту службу. Сама по себе она не включается и не расходует ресурсы компьютера.\n...но если очень хочется, то можно выключить."
  },
  "StateRepository": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%80%d0%b5%d0%bf%d0%be%d0%b7%d0%b8%d1%82%d0%be%d1%80%d0%b8%d1%8f-%d1%81%d0%be%d1%81%d1%82%d0%be%d1%8f%d0%bd%d0%b8%d0%b9",
    "description": "Обеспечивает поддержку требуемой инфраструктуры для модели приложения.",
    "explained": "Служба, поддерживающая всю стилизацию Windows 10.",
    "recommendation": "Учитывая, что от службы зависят:\nвсе плиточные стили Windows 10\nвсе стили размытия Windows 10\nвсе элементы интерфейса, присущие только Windows 10\nСлужбу нельзя отключать.Отключение службы выведет из строя отзывчивость Параметров, меню Пуск, Панели задач в целом, всего плиточного и всего присущего только интерфейсу Windows 10."
  },
  "SysMain": {
    "url": "https://win10tweaker.ru/twikinarium/services/sysmain-superfetch",
    "description": "Поддерживает и улучшает производительность системы.",
    "explained": "Служба, имевшая когда-то имя Superfetch, а ныне SysMain. Несколько раз обновляемая компанией Microsoft, но так и не нашедшая любви и признания у пользователей. Призвана повысить скорость работы Windows за счёт кэширования данных, которые использует пользователь. Запустили Вы браузер, например, а память сохранила все инструкции, которые выполнял браузер. Более того, SysMain объединяет одинаковые участки памяти (одинаковые сценарии, код и т.д.), можно сказать, сжимает, чтобы сэкономить место на диске. На каком диске? На том, на который этот кэш потом упадёт, а Windows потом считает. Таким образом повторный запуск программы осуществляется быстрее за счёт кэша, который будет сидеть в папке C:\\Windows\\Prefetch. Кстати, на ранних стадиях развития этой службы, папка раздувалась, а сейчас ограничена 100 файлами.",
    "recommendation": "Учитывая следующее:\nТехнология не является для всех одинаково полезной\nОтключение службы ничего за собой не повлечёт. Однако, если вы захотите повысить производительность за счёт кэширования одинаковых сценариев использования компьютера, можете оставить службу включённой. Но что, если вы решили поиграть в игру, которая забирает бóльшую часть оперативки? Компьютер должен выделить весь кэш для одной только игры? А что если у вас SSD? Будем тарабанить по нему? Не жалко?... В общем, спорная технология, которая приводит Меня к следующим выводам:Если у вас слабенький ПК с небольшим объёмом оперативной памяти, вы не играете в игры (на HDD) и выполняете лишь однотипные рутинные задачи рабочего ПК – вам нужна служба.\nЕсли у вас достаточно мощный ПК с объёмом оперативной памяти выше 8 ГБ, у вас SSD, и сценарий использования Windows может меняться – вам не нужна эта служба.Ещё кое-что вдогонку: если при включённой службе Superfetch (SysMain) в течение 30 минут ваша винда не создала мусор в папке C:\\Windows\\Prefetch, значит, объёма оперативки достаточно для того, чтобы ничего не кэшировать. А значит постоянный мониторинг службы SysMain вам не нужен."
  },
  "Power": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-hyper-v-powershell-direct",
    "description": "Обеспечивает механизм управления виртуальной машиной через PowerShell с помощью сеанса виртуальной машины без виртуальной сети.",
    "explained": "Служба, позволяющая управлять виртуальной машиной с помощью PowerShell, без создания Гостя или сетевого адаптера.",
    "recommendation": "Учитывая следующее:\nЕсли вы не сетевой задрот администратор\nМожете отключить службу."
  },
  "OneSyncSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "MapsBroker": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d1%81%d0%ba%d0%b0%d1%87%d0%b0%d0%bd%d0%bd%d1%8b%d1%85-%d0%ba%d0%b0%d1%80%d1%82",
    "description": "Служба Windows, обеспечивающая доступ приложений к скачанным картам. Эта служба запускается по требованию приложением, которому необходим доступ к скачанным картам. Если вы отключите эту службу, приложения не смогут работать с картами.",
    "explained": "Служба, необходимая для встроенного приложения Карты, чтобы отображать карты, которые скачивает пользователь.",
    "recommendation": "Учитывая следующее:\nВы не пользуетесь Картами Windows\nМожно отключить службу."
  },
  "CoreMessagingRegistrar": {
    "url": "https://win10tweaker.ru/twikinarium/services/coremessaging",
    "description": "Manages communication between system components.",
    "explained": "С помощью этой службы производится связь между компонентами системы. Один процесс зависит от другого, одна dll необходима другой, одна служба зависит от другой, а следит за этим одна из самых важных служб Windows – CoreMessaging.",
    "recommendation": "Учитывая следующее:\nСлужба имеет серьёзные зависимости\nСледит за связью между компонентами системы\nОтключать эту службу нельзя, иначе вы гарантированно не сможете загрузить Windows."
  },
  "LxpSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-language-experience-service",
    "description": "Обеспечивает поддержку инфраструктуры для развертывания и настройки локализованных ресурсов Windows. Эта служба запускается по требованию. Если она отключена, дополнительные языки Windows не будут развернуты в системе, а ОС Windows может работать неправильно.",
    "explained": "Служба, позволяющая скачивать другие локализации (языки) системы. Служба запускается каждый раз, когда вы посещаете Параметры Windows ➜ Время и Язык ➜ Язык.",
    "recommendation": "Учитывая следующее:\nЕсли вы уже скачали нужные вам языки\nСлужба запускается даже тогда, когда это не нужно\nМожете отключить службу. Для переключения языков не нужна служба. Она нужна только для закачки языков."
  },
  "UevAgentService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b2%d0%b8%d1%80%d1%82%d1%83%d0%b0%d0%bb%d0%b8%d0%b7%d0%b0%d1%86%d0%b8%d0%b8-%d0%b2%d0%b7%d0%b0%d0%b8%d0%bc%d0%be%d0%b4%d0%b5%d0%b9%d1%81%d1%82%d0%b2%d0%b8%d1%8f",
    "description": "Обеспечивает поддержку при перемещении параметров приложений и ОС",
    "explained": "Служба-помощник переноса данных реестра, файлов, рабочего стола и прочего при переустановке Windows.\nПодробнее о псевдо-попытке сделать хорошо.",
    "recommendation": "Учитывая следующее:\nЭта служба не нужна \nСлужбу стоит оставить на Отключена."
  },
  "upnphost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%b7%d0%b5%d0%bb-%d1%83%d0%bd%d0%b8%d0%b2%d0%b5%d1%80%d1%81%d0%b0%d0%bb%d1%8c%d0%bd%d1%8b%d1%85-pnp-%d1%83%d1%81%d1%82%d1%80%d0%be%d0%b9%d1%81%d1%82%d0%b2",
    "description": "Позволяет размещать устройства UPnP на этом компьютере. Если эта служба остановлена, все UPnP-устройства прекратят работу, и добавить дополнительные устройства будет невозможно. Если данная служба отключена, все явно зависящие от нее службы запустить не удастся.",
    "explained": "Служба, позволяющая делиться возможностями устройств, подключённых к компьютеру. То есть разрешать компьютерам из локальной сети взаимодействовать с устройством на главном компьютере. В быту применяется, когда у вас много гаджетов и телевизоров и вам часто приходится делить контент между ними (расшаривать данные между устройствами).",
    "recommendation": "Учитывая следующее:\nСлужба редко используется в быту\nУ службы есть альтернативные подходы, например, виртуальные VPN-серверы\nМожете отключить службу."
  },
  "RetailDemo": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b4%d0%b5%d0%bc%d0%be%d0%bd%d1%81%d1%82%d1%80%d0%b0%d1%86%d0%b8%d0%b8-%d0%bc%d0%b0%d0%b3%d0%b0%d0%b7%d0%b8%d0%bd%d0%b0",
    "description": "Служба демонстрации магазина контролирует действия устройства, когда на нем используется режим демонстрации магазина.",
    "explained": "Служба 2 в 1. В первом сценарии, благодаря этой службе, Windows определяет статус активации вашей операционной системы, и, если вы ещё не активировали её, служба контролирует те области, которые должны быть недоступны оставляя лишь так называемые демо-возможности. Второй сценарий использования службы – это преобразование вашего устройства в онлайн-магазин, где вы можете создавать карточки товаров, цену, описание и т.д.\nНе путать с Windows Киоском.",
    "recommendation": "Учитывая следующее:\nЕсли у вас домашний персональный компьютер или ноутбук\nРекомендуется отключить службу."
  },
  "SensrSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bd%d0%b0%d0%b1%d0%bb%d1%8e%d0%b4%d0%b5%d0%bd%d0%b8%d1%8f-%d0%b7%d0%b0-%d0%b4%d0%b0%d1%82%d1%87%d0%b8%d0%ba%d0%b0%d0%bc%d0%b8",
    "description": "Ведет наблюдение за различными датчиками для предоставления доступа к данным адаптации к системному и пользовательскому состоянию. В случае остановки или отключения этой службы корректировка яркости дисплея в соответствии с освещенностью не производится. Остановка этой службы также может повлиять на другие функции системы.",
    "explained": "Служба, отвечающая за яркость экрана благодаря показателям датчиков планшета / смартфона под управлением Windows 10.",
    "recommendation": "Учитывая следующее:\nЕсли у вас настольный компьютер или ноутбук\nМожете отключить службу."
  },
  "SCardSvr": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bc%d0%b0%d1%80%d1%82-%d0%ba%d0%b0%d1%80%d1%82%d0%b0",
    "description": "Управляет доступом к устройствам чтения смарт-карт. Если эта служба остановлена, этот компьютер не сможет считывать смарт-карты. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Основная служба, запускающая все процессы, связанные со смарт-картами.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь смарт-картами\nМожете отключить службу."
  },
  "PushToInstall": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-pushtoinstall-windows",
    "description": "Обеспечивает поддержку инфраструктуры для Microsoft Store. Эта служба запускается автоматически и если отключена, то удаленные установки не будут функционировать должным образом.",
    "explained": "Служба, позволяющая удалённо устанавливать приложения из Магазина Windows на устройства, в которых вы авторизованы под своей учётной записью Microsoft.",
    "recommendation": "Учитывая следующее:\nХотели как в Google, а получилось как всегда\nМожете отключить службу."
  },
  "RemoteAccess": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bc%d0%b0%d1%80%d1%88%d1%80%d1%83%d1%82%d0%b8%d0%b7%d0%b0%d1%86%d0%b8%d1%8f-%d0%b8-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d0%b9-%d0%b4%d0%be%d1%81%d1%82%d1%83%d0%bf",
    "description": "Предлагает услуги маршрутизации организациям в локальной и глобальной сетях.",
    "explained": "Серверная служба, помогающая построить локальную сеть через глобальную либо через VPN.",
    "recommendation": "Учитывая следующее:\nДомашние сети не используют интерфейс данной службы\nСлужбу можно не трогать и оставить на Отключена."
  },
  "RasMan": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-sstp",
    "description": "Обеспечивает поддержку протокола SSTP (Secure Socket Tunneling Protocol) для подключения к удаленным компьютерам с помощью VPN. Если эта служба отключена, пользователи не смогут использовать SSTP для доступа к удаленным серверам.",
    "explained": "Служба обеспечивает шифрование трафика во время удалённого подключения к компьютерам через VPN.",
    "recommendation": "Учитывая следующее:\nСлужба запускается только при наличии VPN-соединений / Защищённых соединений между устройствами\nНекоторые VPN-клиенты пользуются этой службой\nМожете отключить службу, но лучше просто оставить её Вручную.\nОтключение службы ничему не навредит, однако ваш трафик перестанет шифроваться."
  },
  "RpcLocator": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bb%d0%be%d0%ba%d0%b0%d1%82%d0%be%d1%80-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d0%be%d0%b3%d0%be-%d0%b2%d1%8b%d0%b7%d0%be%d0%b2%d0%b0-%d0%bf%d1%80%d0%be%d1%86%d0%b5%d0%b4%d1%83%d1%80-rpc",
    "description": "В Windows 2003 и более ранних версиях Windows служба \"Локатор удаленного вызова процедур (RPC)\" управляла базой данных службы имен RPC. В Windows Vista и более поздних версиях Windows эта служба не выполняет каких-либо функций и присутствует для обеспечения совместимости с устаревшими приложениями.",
    "explained": "Служба, необходимая для поддержки старых типов баз данных.",
    "recommendation": "Учитывая следующее:\nНикто не пользуется старыми типами баз данных\nСлужбу можно отключить."
  },
  "RpcEptMapper": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%be%d0%bf%d0%be%d1%81%d1%82%d0%b0%d0%b2%d0%b8%d1%82%d0%b5%d0%bb%d1%8c-%d0%ba%d0%be%d0%bd%d0%b5%d1%87%d0%bd%d1%8b%d1%85-%d1%82%d0%be%d1%87%d0%b5%d0%ba-rpc",
    "description": "Обеспечивает разрешение идентификаторов интерфейсов RPC до конечных точек транспорта. Если эта служба остановлена или отключена, программы, использующие службы удаленного вызова процедур (RPC), не смогут работать.",
    "explained": "Служба, отвечающая за политику разрешений для всего, что находится в Windows: текстовые файлы, папки, программы, сеть и прочее. На основе этой службы работает вся логика объектно-ориентированных расширений.",
    "recommendation": "Учитывая следующее:\nБез этой службы можно забыть о работе Windows\nСлужба имеет серьёзные зависимости\nСлужбу нельзя отключать.Отключение службы не даст загрузиться на Рабочий стол – сразу после запуска компьютера и загрузки Windows вы увидите чёрный экран, из которого не удастся выйти."
  },
  "seclogon": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b2%d1%82%d0%be%d1%80%d0%b8%d1%87%d0%bd%d1%8b%d0%b9-%d0%b2%d1%85%d0%be%d0%b4-%d0%b2-%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d1%83",
    "description": "Позволяет запускать процессы от имени другого пользователя. Если эта служба остановлена, этот тип регистрации пользователя недоступен. Если эта служба отключена, то нельзя запустить другие службы, которые явно зависят от нее.",
    "explained": "Служба позволяет запускать программы, процессы, сценарии от разных пользователей, включая СИСТЕМА и TrustedInstaller.",
    "recommendation": "Учитывая следующее:\nСлужба запускается только, когда система или суперюзер что-то выполняет с привилегиями СИСТЕМА и TrustedInstaller\nСлужбу не рекомендуется отключать."
  },
  "SgrmBroker": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-advanced-threat-protection-%d0%b2-%d0%b7%d0%b0%d1%89%d0%b8%d1%82%d0%bd%d0%b8%d0%ba%d0%b5-windows",
    "description": "Служба Advanced Threat Protection в Защитнике Windows помогает защитить от дополнительных угроз посредством наблюдения и отчетности о событиях безопасности, происходящих на компьютере.",
    "explained": "Дочерняя служба Защитника Windows, которая говорит Защитнику что делать на основе событий безопасности Windows.",
    "recommendation": "Учитывая следующее:\nГрош цена той защите, которую можно положить в один клик\nСлужбу можно отключить Командой:\nfor /f %I in ('reg query \"HKLM\\SYSTEM\\CurrentControlSet\\Services\" /k /f \"Sense\" ^| find /i \"Sense\"') do (reg add \"%I\" /v \"Start\" /t reg_dword /d 4 /f)Однако это не остановит и не отключит другие дочерние объекты Защитника. Поэтому рекомендуется избавляться от всей этой шушеры (псевдозащиты) именно в Win 10 Tweaker.\nWin 10 Tweaker первая и всё ещё единственная программа, которая в реальном времени отключает Antimalware."
  },
  "SENS": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d0%bd%d1%8b%d1%85-%d1%81%d0%be%d0%b1%d1%8b%d1%82%d0%b8%d0%b9-sens",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "SSDPSRV": {
    "error": true,
    "message": "Not found"
  },
  "SensorDataService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b4%d0%b0%d0%bd%d0%bd%d1%8b%d1%85-%d0%b4%d0%b0%d1%82%d1%87%d0%b8%d0%ba%d0%be%d0%b2",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "SmsRouter": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bc%d0%b0%d1%80%d1%88%d1%80%d1%83%d1%82%d0%b8%d0%b7%d0%b0%d1%82%d0%be%d1%80%d0%b0-sms-microsoft-windows",
    "description": "Перенаправляет сообщения на основе правил на соответствующие клиенты.",
    "explained": "Служба, отвечающая за отправку SMS через виртуальный роутер Windows.",
    "recommendation": "Учитывая следующее:\nКогда Ваш телефон стал выдавать такое, Microsoft решили отказаться от использования службы,\nSMS при этом всё равно работают ┐('~`;)┌\nРекомендуется отключить службу."
  },
  "SEMgrSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bf%d0%bb%d0%b0%d1%82%d0%b5%d0%b6%d0%b5%d0%b9-%d0%b8-nfc",
    "description": "Управляет платежами и защищенными элементами на основе NFC.",
    "explained": "Служба, поддерживающая использование NFC на вашем устройстве.",
    "recommendation": "Учитывая следующее:\nУ вас настольный компьютер или ноутбук\nВаше устройство не имеет NFС\nСлужбу можно отключить."
  },
  "Sense": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-advanced-threat-protection-%d0%b2-%d0%b7%d0%b0%d1%89%d0%b8%d1%82%d0%bd%d0%b8%d0%ba%d0%b5-windows",
    "description": "Служба Advanced Threat Protection в Защитнике Windows помогает защитить от дополнительных угроз посредством наблюдения и отчетности о событиях безопасности, происходящих на компьютере.",
    "explained": "Дочерняя служба Защитника Windows, которая говорит Защитнику что делать на основе событий безопасности Windows.",
    "recommendation": "Учитывая следующее:\nГрош цена той защите, которую можно положить в один клик\nСлужбу можно отключить Командой:\nfor /f %I in ('reg query \"HKLM\\SYSTEM\\CurrentControlSet\\Services\" /k /f \"Sense\" ^| find /i \"Sense\"') do (reg add \"%I\" /v \"Start\" /t reg_dword /d 4 /f)Однако это не остановит и не отключит другие дочерние объекты Защитника. Поэтому рекомендуется избавляться от всей этой шушеры (псевдозащиты) именно в Win 10 Tweaker.\nWin 10 Tweaker первая и всё ещё единственная программа, которая в реальном времени отключает Antimalware."
  },
  "smphost": {
    "url": "https://win10tweaker.ru/twikinarium/services/smp-%d0%b4%d0%b8%d1%81%d0%ba%d0%be%d0%b2%d1%8b%d1%85-%d0%bf%d1%80%d0%be%d1%81%d1%82%d1%80%d0%b0%d0%bd%d1%81%d1%82%d0%b2-%d0%bc%d0%b0%d0%b9%d0%ba%d1%80%d0%be%d1%81%d0%be%d1%84%d1%82",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "SensorService": {
    "error": true,
    "message": "Not found"
  },
  "shpamsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/shared-pc-account-manager",
    "description": "Manages profiles and accounts on a SharedPC configured device",
    "explained": "Служба необходима для управления аккаунтами всех компьютеров, подключённых через Общий доступ. На практике служба никем не используется, поэтому отключена по умолчанию.",
    "recommendation": "Учитывая следующее:\nОт этой службы не зависят другие службы\nСама служба не запускается\nНа службу можно не обращать внимания."
  },
  "TapiSrv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%82%d0%b5%d0%bb%d0%b5%d1%84%d0%be%d0%bd%d0%b8%d1%8f",
    "description": "Обеспечивает поддержку Telephony API (TAPI) для программ, управляющих телефонным оборудованием на этом компьютере, а также через ЛВС - на серверах, где запущена соответствующая служба.",
    "explained": "Служба, обеспечивающая канал связи путём создания виртуальной телефонной станции. Необходима для использования факса.",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет факса\nСлужба никак не связана с приложением Ваш телефон\nМожете отключить службу.Побочным эффектом может стать недоступность некоторых VPN-клиентов соединяться к своим серверам.\nПросто имейте это в виду."
  },
  "TrkWks": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%ba%d0%bb%d0%b8%d0%b5%d0%bd%d1%82-%d0%b8%d0%b7%d0%bc%d0%b5%d0%bd%d0%b8%d0%b2%d1%88%d0%b8%d1%85%d1%81%d1%8f-%d1%81%d0%b2%d1%8f%d0%b7%d0%b5%d0%b9-trkwks",
    "description": "Поддерживает связи NTFS-файлов, перемещаемых в пределах компьютера или между компьютерами в сети.",
    "explained": "Служба, некогда занимающаяся отслеживанием перемещения файлов, чтобы ярлыки всегда находили путь к своим программам. Также это касалось локальных сетей.",
    "recommendation": "Учитывая следующее:\nФункции службы прекрасно работают локально и по сети без включённого состояния\nСлужбу можно отключить."
  },
  "EventSystem": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d0%b0-%d1%81%d0%be%d0%b1%d1%8b%d1%82%d0%b8%d0%b9-com",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "DusmSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b8%d1%81%d0%bf%d0%be%d0%bb%d1%8c%d0%b7%d0%be%d0%b2%d0%b0%d0%bd%d0%b8%d0%b5-%d0%b4%d0%b0%d0%bd%d0%bd%d1%8b%d1%85",
    "description": "Использование данных сети, лимит трафика, ограничение фоновой передачи данных, сети с лимитным тарифным планом.",
    "explained": "Служба, предоставляющая возможность ставить лимит трафика и просматривать объём скачанной информации.",
    "recommendation": "Учитывая следующее:\nЕсли вам не нужна информация о том, сколько вы накачали в сумме\nЕсли вы не устанавливаете лимиты на трафик\nМожете отключить службу."
  },
  "LocalKdc": {
    "error": true,
    "message": "Not found"
  },
  "HvHost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%b7%d0%bb%d0%b0-hv",
    "description": "Интерфейс для низкоуровневой оболочки Hyper-V, обеспечивающий функционирование счетчиков производительности по разделам для оперативной системы узла.",
    "explained": "Служба, контролирующая свободное место на виртуальной машине Microsoft. Запускается только в случае переполнения памяти, выделенной для виртуальной машины.",
    "recommendation": "Учитывая следующее:\nНикто не пользуется виртуальными машинами Microsoft\nМожете отключить службу."
  },
  "NetSetupSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bd%d0%b0%d1%81%d1%82%d1%80%d0%be%d0%b9%d0%ba%d0%b8-%d1%81%d0%b5%d1%82%d0%b8",
    "description": "Служба параметры сети управляет установкой сетевых драйверов и разрешает конфигурацию низкоуровневых параметров сети. В случае остановки этой службы все выполняемые установки драйверов могут быть отменены.",
    "explained": "Служба, контролирующая установку и преобразование типа сети Windows.",
    "recommendation": "Учитывая следующее:\nСлужба запускается только в настройках сети\nСлужба занимается подбором драйверов для сетевых адаптеров\nРекомендуется оставить службу Вручную."
  },
  "XblGameSave": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%be%d1%85%d1%80%d0%b0%d0%bd%d0%b5%d0%bd%d0%b8%d0%b5-%d0%b8%d0%b3%d1%80-%d0%bd%d0%b0-xbox-live",
    "description": "Эта служба синхронизирует данные сохранения игр с активированной функцией сохранения на Xbox Live. При выключении этой службы сохраненные данные игр не будут отправляться на Xbox Live или загружаться оттуда.",
    "explained": "Служба, отвечающая за сохранения игр в сервисе Xbox Live.",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет Xbox\nМожете отключить службу."
  },
  "vmicheartbeat": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d1%83%d0%bb%d1%8c%d1%81%d0%b0-hyper-v",
    "description": "Эта служба следит за состоянием виртуальной машины и регулярно генерирует пульс. Она помогает выявлять выполняющиеся виртуальные машины, которые перестали отвечать.",
    "explained": "Служба, контролирующая работу виртуальных машин Microsoft, чтобы сообщать об их сбоях и зависаниях.",
    "recommendation": "Учитывая следующее:\nВы не пользуетесь виртуальными машинами Microsoft\nМожете отключить службу."
  },
  "UserManager": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bf%d0%be%d0%bb%d1%8c%d0%b7%d0%be%d0%b2%d0%b0%d1%82%d0%b5%d0%bb%d0%b5%d0%b9",
    "description": "Диспетчер пользователей предоставляет компоненты среды выполнения, необходимые для взаимодействия нескольких пользователей. Если эта служба остановлена, некоторые приложения могут работать неправильно.",
    "explained": "Служба, необходимая для определения параметров пользователя.",
    "recommendation": "Учитывая следующее:\nОт службы зависит загрузка Рабочего стола профиля\nСлужбу нельзя отключать. Отключение службы приведёт к долгой загрузке Рабочего стола, а потом к невозможности загрузить настройки профиля. Мерцание оболочки Проводника и бесконечный цикл поиска профиля пользователя."
  },
  "Themes": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%82%d0%b5%d0%bc%d1%8b",
    "description": "Управление темами оформления.",
    "explained": "Служба управления темами.",
    "recommendation": "Учитывая следующее:\nЕсли вы закончили с оформлением визуального стиля Windows\nМожете отключить службу."
  },
  "StorSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%85%d1%80%d0%b0%d0%bd%d0%b8%d0%bb%d0%b8%d1%89%d0%b0",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "vmicguestinterface": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b8%d0%bd%d1%82%d0%b5%d1%80%d1%84%d0%b5%d0%b9%d1%81-%d0%b3%d0%be%d1%81%d1%82%d0%b5%d0%b2%d0%be%d0%b9-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-hyper-v",
    "description": "Интерфейс для взаимодействия узла Hyper-V с определенными службами, которые выполняются на виртуальной машине.",
    "explained": "Служба, которая позволяет копировать файлы в гостевую ОС виртуальной машины Microsoft.",
    "recommendation": "Учитывая следующее:\nНикто не пользуется виртуальными машинами Microsoft\nСлужбу можно отключить."
  },
  "tzautoupdate": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b0%d0%b2%d1%82%d0%be%d0%bc%d0%b0%d1%82%d0%b8%d1%87%d0%b5%d1%81%d0%ba%d0%be%d0%b5-%d0%be%d0%b1%d0%bd%d0%be%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d0%b5-%d1%87%d0%b0%d1%81%d0%be%d0%b2%d0%be%d0%b3%d0%be",
    "description": "Автоматическая настройка часового пояса для системы.",
    "explained": "Служба проверки часового пояса.",
    "recommendation": "Учитывая следующее:\nСлужба отключена по умолчанию\nРекомендуется не трогать службу."
  },
  "AppXSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%80%d0%b0%d0%b7%d0%b2%d0%b5%d1%80%d1%82%d1%8b%d0%b2%d0%b0%d0%bd%d0%b8%d1%8f-appx-appxsvc",
    "description": "Обеспечивает поддержку инфраструктуры для развертывания приложений из Store. Эта служба запускается по требованию. Если она отключена, приложения из Store не будут развертываться в системе и могут работать неправильно.",
    "explained": "Служба, отвечающая за управление приложениями, а также за отображение их в системе.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь Магазином Windows\nМожете отключить службу Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\AppXSvc /v Start /t reg_dword /d 4 /fОтключение службы приведёт к невозможности увидеть установленные приложения, а также к невозможности удалять оффлайн-приложения. Также, если вы отключите службу AppXSvc, при попытке посетить раздел Темы в Параметрах Windows или Система из Меню Пуск, вы увидите ошибку стекового буфера. Что касается последних редакций Windows 10, то ошибка переполнения стекового буфера будет появляться при простой попытке открыть Свойства Компьютера."
  },
  "DeviceAssociationService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%81%d0%be%d0%bf%d0%be%d1%81%d1%82%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-%d1%83%d1%81%d1%82%d1%80%d0%be%d0%b9%d1%81%d1%82%d0%b2",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Учитывая следующее:\nСлужба помогает определять тип устройства, для дальнейшей работы с ним.\nСлужбу не стоит отключать."
  },
  "WdNisSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d1%80%d0%be%d0%b2%d0%b5%d1%80%d0%ba%d0%b8-%d1%81%d0%b5%d1%82%d0%b8-windows-defender-antivirus",
    "description": "Позволяет защититься от попыток вторжения, нацеленных на известные и вновь обнаруженные уязвимости в сетевых протоколах",
    "explained": "Служба, отвечающая за сетевую безопасность.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Защитник Windows\nМожете отключить службу следующим образом: запустите Win 10 Tweaker Pro и в Супердоступе выполните команду:\ncmd.exe /c reg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\WdNisSvc /v Start /t reg_dword /d 4 /f"
  },
  "vds": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b2%d0%b8%d1%80%d1%82%d1%83%d0%b0%d0%bb%d1%8c%d0%bd%d1%8b%d0%b9-%d0%b4%d0%b8%d1%81%d0%ba-vds",
    "description": "Предоставление служб управления дисками, томами, файловыми системами и массивами запоминающих устройств.",
    "explained": "С помощью этой службы вы можете создавать виртуальные жёсткие диски, а также управлять реальными: менять размеры томов, объединять диски и тому подобное – всё, относящееся к управлению хранилищем.",
    "recommendation": "Учитывая следующее:\nСлужба работает только тогда, когда её вызывают\nСлужба отвечает за Управление дисками\nИмеет важные зависимости\nСлужбу отключать не рекомендуется. Даже если вы ничего не будете делать со своим хранилищем, когда-нибудь придёт момент, когда либо вы, либо система будут производить операции с диском с помощью утилит DiskRaid и DiskPart. А если выключить службу Виртуальный диск, то эти утилиты работать не будут. Поэтому и не рекомендуется трогать эту службу. Оставьте Вручную."
  },
  "ssh-agent": {
    "url": "https://win10tweaker.ru/twikinarium/services/openssh-authentication-agent",
    "description": "Agent to hold private keys used for public key authentication.",
    "explained": "Служба для OpenSSH-клиента, входящего в Компоненты Windows, который по умолчанию отключён. Служба появилась в Windows 10 build 1803 в состоянии Вручную, после, в 1809, 1903 и далее перешла в состояние Отключено. Бесполезная служба, учитывая, что родным клиентом OpenSSH опытный пользователь в здравом уме пользоваться не будет. Для этого есть другие решения, не требующие никаких дополнительных служб.",
    "recommendation": "Учитывая следующее:\nДругие службы не зависят от этой службы\nСама служба не зависит от других служб\nСлужба отключена по умолчанию\nСлужбу можно не трогать. Однако, с точки зрения безопасности, службу можно выпилить Командой:\nsc delete ssh-agent"
  },
  "pla": {
    "url": "https://win10tweaker.ru/twikinarium/services/plug-and-play",
    "description": "Позволяет компьютеру распознавать изменения в установленном оборудовании и подстраиваться под них, либо не требуя вмешательства пользователя, либо сводя его к минимуму. Остановка или отключение этой службы может привести к нестабильной работе системы.",
    "explained": "Служба необходима для автоматического определения подключённых к компьютеру устройств. Если устройство поддерживает Plug and Play, то Windows, при подключении такого устройства, сразу же отображает устройство в соответствии с его назначением. Например, флэшку сразу принимает за флэшку, принтер не торопится показывать, сначала подбирает драйверы, потом отображает устройство как принтер.",
    "recommendation": "Учитывая следующее:\nБольшинство устройств работают по технологии Plug and Play\nБез этой службы устройство не сможет идентифицироваться в системе\nСлужбу трогать не рекомендуется."
  },
  "BDESVC": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%88%d0%b8%d1%84%d1%80%d0%be%d0%b2%d0%b0%d0%bd%d0%b8%d1%8f-%d0%b4%d0%b8%d1%81%d0%ba%d0%be%d0%b2-bitlocker",
    "description": "BDESVC предоставляет службу шифрования диска BitLocker. Шифрование диска BitLocker обеспечивает защищенный запуск операционной системы, а также полное шифрование тома ОС, фиксированных и съемных томов. Эта служба позволяет BitLocker предлагать пользователям различные действия, связанные с подключением их томов, и автоматически разблокирует тома без пользовательского вмешательства. Кроме того, она по возможности сохраняет сведения о восстановлении в Active Directory и при необходимости гарантирует использование новейших сертификатов восстановления. Остановка или отключение этой службы может помешать пользователям применять эти функции.",
    "explained": "Служба, похожая по принципу на EFS, позволяющая шифровать все данные на системном диске во избежание несанкционированного доступа. Под несанкционированным доступом имеется в виду случай, когда данные пытаются прочитать на другом компьютере (даже под управлением такой же версии Windows). Нельзя просто так взять и своровать HDD / SSD из компа и прочесть его на другом компе, если он защищён BitLocker.",
    "recommendation": "Учитывая следующее:\nСлужба тормозит работу, поэтому по умолчанию не работает, начиная с Windows 8.1\nМожете отключить службу."
  },
  "PhoneSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%82%d0%b5%d0%bb%d0%b5%d1%84%d0%be%d0%bd%d0%bd%d0%b0%d1%8f-%d1%81%d0%b2%d1%8f%d0%b7%d1%8c",
    "description": "Управляет состоянием телефонной связи на устройстве",
    "explained": "Служба, поддерживающая постоянную связь с телефоном.",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет факса\nСлужба никак не связана с приложением Ваш телефон\nМожете отключить службу."
  },
  "BcastDVRUserService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "InventorySvc": {
    "error": true,
    "message": "Not found"
  },
  "KtmRm": {
    "url": "https://win10tweaker.ru/twikinarium/services/ktmrm-%d0%b4%d0%bb%d1%8f-%d0%ba%d0%be%d0%be%d1%80%d0%b4%d0%b8%d0%bd%d0%b0%d1%82%d0%be%d1%80%d0%b0",
    "description": "Координирует транзакции между MS DTC и диспетчером транзакций ядра (KTM). Если данная служба не требуется, рекомендуется не запускать ее. Если она потребуется, MS DTC или KTM автоматически запустят ее. Если служба отключена, то при взаимодействии MS DTC с диспетчером транзакций ядра будут возникать ошибки и запуск всех служб, явно зависящих от нее, станет невозможным.",
    "explained": "Когда вы работаете в локальной сети (включая один единственный компьютер) и делаете операции с базами данных, документами, файлами и т.д., следить за этими операциями должна служба KtmRm для координатора распределенных транзакций. Главный вопрос – Зачем. К примеру, вы перетаскиваете файл с одного диска на другой, а потом решили передумать и прерываете операцию. Нужна специальная служба, чтобы восстановить раздел на то состояние, которое этот раздел имел до операции переноса, а также нужно восстановить файл на то место, откуда вы его переносили. С реестром то же самое. В случае внезапного отключения компьютера, система должна фиксировать состояние системы до начала каждой операции на компьютере, чтобы иметь возможность восстановить это самое состояние.",
    "recommendation": "Учитывая следующее:\nСлужба не работает по умолчанию всё время\nТипа запуска по умолчанию установлен на Вручную\nВызывается служба только тогда, когда это требуется\nСлужбу не рекомендуется отключать.\nОднако, если вы сделаете это, на работе локальной сети для передачи файлов это никак не скажется."
  },
  "WdiServiceHost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%b7%d0%b5%d0%bb-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-%d0%b4%d0%b8%d0%b0%d0%b3%d0%bd%d0%be%d1%81%d1%82%d0%b8%d0%ba%d0%b8",
    "description": "Узел службы диагностики используется службой политики диагностики для размещения средств диагностики, запускаемых в контексте локальной службы. Если остановить эту службу, некоторые средства диагностики, зависящие от нее, не смогут работать.",
    "explained": "Служба, создающая видимость пользы диагностики компьютера на уровне операционной системы.",
    "recommendation": "Учитывая следующее:\nСлужба расходует ресурсы\nСлужба не несёт пользы\nСлужбу нужно отключить."
  },
  "PimIndexMaintenanceSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "VSS": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%82%d0%b5%d0%bd%d0%b5%d0%b2%d0%be%d0%b5-%d0%ba%d0%be%d0%bf%d0%b8%d1%80%d0%be%d0%b2%d0%b0%d0%bd%d0%b8%d0%b5-%d1%82%d0%be%d0%bc%d0%b0",
    "description": "Управляет созданием теневых копий (контрольных точек состояния) дисковых томов, которые используются для архивации и восстановления или для иных целей. Если эта служба остановлена, теневые копии томов для восстановления не будут доступны и архивация и восстановление могут не работать. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Основная служба, благодаря которой работают такие программы, как История файлов, Программа архивации и прочие из разряда восстановления данных.",
    "recommendation": "Учитывая следующее:\nОт службы зависят многие компоненты системы, отвечающие за резервное копирование данных\nСлужбу не рекомендуется отключать. Запускается она только по требованию."
  },
  "svsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b1%d1%8b%d1%81%d1%82%d1%80%d0%b0%d1%8f-%d0%bf%d1%80%d0%be%d0%b2%d0%b5%d1%80%d0%ba%d0%b0",
    "description": "Проверяет потенциальные повреждения файловой системы.",
    "explained": "Служба необходима для отлавливания битых секторов жёсткого диска (HDD), чтобы своевременно предпринять меры ➜ чтобы вы не потеряли свои данные.",
    "recommendation": "Учитывая следующее:\nСлужба не зависит от других служб\nДругие службы не зависят от этой службы\nСлужбу можно отключить. Однако помните, что, используя HDD в качестве хранения данных, службу лучше оставить в режиме Вручную."
  },
  "vmickvpexchange": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%be%d0%b1%d0%bc%d0%b5%d0%bd%d0%b0-%d0%b4%d0%b0%d0%bd%d0%bd%d1%8b%d0%bc%d0%b8-hyper-v",
    "description": "Служба предоставляет механизм обмена данными между виртуальной машиной и операционной системой физического компьютера.",
    "explained": "Служба, позволяющая переносить файлы и папки с виртуальной машины Microsoft на реальную и наоборот.",
    "recommendation": "Учитывая следующее:\nВы не пользуетесь виртуальной машиной от Microsoft\nРекомендуется отключить службу."
  },
  "vmictimesync": {
    "error": true,
    "message": "Not found"
  },
  "Schedule": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%bb%d0%b0%d0%bd%d0%b8%d1%80%d0%be%d0%b2%d1%89%d0%b8%d0%ba-%d0%b7%d0%b0%d0%b4%d0%b0%d0%bd%d0%b8%d0%b9",
    "description": "Позволяет настраивать расписание автоматического выполнения задач на этом компьютере. Данная служба также отвечает за выполнение нескольких критически важных системных задач Windows. Если эта служба остановлена, эти задачи не могут быть запущены в установленное расписанием время. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Служба, необходимая для выполнения запланированных задач, как пользователем, так и самой Windows.",
    "recommendation": "Учитывая следующее:\nОт службы зависит выполнение системных задач в фоновом режиме\nОт службы зависит в принципе возможность планировать задачи по расписанию\nОт службы зависит задача проверки лицензии Windows,\nкоторая, в свою очередь, зависит от системы активации Windows\nСлужбу нельзя отключать, начиная с Windows 8.1 и выше.\nОтключение службы приведёт к массовому отключению многих запланированных заданий, сломает набор текста на панели задач и прочее, что забьёт Журнал событий Windows огромным количеством ошибок."
  },
  "DsmSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bd%d0%b0%d1%81%d1%82%d1%80%d0%be%d0%b9%d0%ba%d0%b8-%d1%83%d1%81%d1%82%d1%80%d0%be%d0%b9%d1%81%d1%82%d0%b2",
    "description": "Включение обнаружения, скачивания и установки программного обеспечения, относящегося к устройствам. Если эту службу отключить, то устройства могут быть настроены на использование устаревшего программного обеспечения и работать неправильно.",
    "explained": "Служба, мгновенно и автоматически подбирающая драйверы для устройств, которые впервые подключаются к компьютеру. Подбор драйверов служба осуществляет онлайн, не хуже не лучше любой альтернативы – одинаково.",
    "recommendation": "Учитывая следующее:\nСлужба включается только, когда появляется новое устройство\nСлужбу лучше не отключать и оставить Вручную.\nЕсли вы отключите службу, то Windows всё равно будет подбирать драйверы, но уже не новые, а старые – из своей постоянной базы."
  },
  "WinHttpAutoProxySvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%be%d0%b1%d0%bd%d0%b0%d1%80%d1%83%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f-%d0%b2%d0%b5%d0%b1-%d0%bf%d1%80%d0%be%d0%ba%d1%81%d0%b8-winhttp",
    "description": "WinHTTP реализует стек клиента HTTP и обеспечивает разработчикам Win32 API и компонент автоматизации COM для отправки запросов HTTP и получения ответов. Кроме того, WinHTTP обеспечивает поддержку автоматического обнаружения конфигурации прокси через реализацию протокола WPAD (Web Proxy Auto-Discovery).",
    "explained": "Служба, благодаря которой на вашем компьютере в принципе может работать прокси. Нужен прокси – нужна служба.",
    "recommendation": "Учитывая следующее:\nПрокси нужен. Не сегодня, так завтра\nНе стоит трогать эту службу."
  },
  "wbengine": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bc%d0%be%d0%b4%d1%83%d0%bb%d1%8f-%d0%b0%d1%80%d1%85%d0%b8%d0%b2%d0%b0%d1%86%d0%b8%d0%b8-wbengine",
    "description": "Служба WBENGINE используется архивацией данных для выполнения операций архивации и восстановления. Если пользователь остановит эту службу, это может привести к ошибке текущей операции архивации или восстановления. Отключение этой службы может привести к отключению операций архивации и восстановления, использующих архивацию данных на этом компьютере.",
    "explained": "Служба, отвечающая за настройки архивации Windows, чтобы не было такого.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете архивацию и восстановление Windows\nЕсли вы используете Acronis True Image\nМожете отключить службу.Помните – не все программы являются аналогами Acronis True Image.\nБольшинство бесплатных альтернатив Acronis True Image работают с помощью теневого копирования, а значит им нужны все 5 служб:\nПрограмма архивации данных\nПрограммный поставщик теневого копирования (Microsoft)\nТеневое копирование тома\nСлужба модуля архивации на уровне блоков\nРабочая станция"
  },
  "TroubleshootingSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d1%81%d1%82%d1%80%d0%b0%d0%bd%d0%b5%d0%bd%d0%b8%d1%8f-%d0%bd%d0%b5%d0%bf%d0%be%d0%bb%d0%b0%d0%b4%d0%be%d0%ba-troubleshootingsvc",
    "description": "Позволяет автоматически устранять известные проблемы, применяя рекомендуемые способы устранения неполадок. Если устройство будет остановлено, оно не получит рекомендации по устранению неполадок на нем.",
    "explained": "Служба, которая предугадывает причину неполадок и предлагает решение проблемы.",
    "recommendation": "Учитывая следующее:\nВ 100% случаях диагностика и решение ничего не дают\nМожете отключить службу."
  },
  "WinDefend": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b0%d0%bd%d1%82%d0%b8%d0%b2%d0%b8%d1%80%d1%83%d1%81%d0%bd%d0%b0%d1%8f-%d0%bf%d1%80%d0%be%d0%b3%d1%80%d0%b0%d0%bc%d0%bc%d0%b0-%d0%b7%d0%b0%d1%89%d0%b8%d1%82%d0%bd%d0%b8%d0%ba%d0%b0-windows",
    "description": "Позволяет пользователям защититься от вредоносных и иных потенциально нежелательных программ",
    "explained": "Программное обеспечение, разработанное Microsoft, целью которого является попытка доказать миру, что они тоже могут делать антивирусы.",
    "recommendation": "Учитывая следующее:\nСлужба предоставляет только ощущение безопасности\nВыпиливается с помощью Win 10 Tweaker в один клик\nГрош цена такой защите.\nВыпиливаем с помощью Win 10 Tweaker.\nНи батничками, ни ручками вы защиту не остановите. Как, впрочем, и любой другой программой."
  },
  "WiaRpc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%be%d0%b1%d1%8b%d1%82%d0%b8%d1%8f-%d0%bd%d0%b5%d0%bf%d0%be%d0%b4%d0%b2%d0%b8%d0%b6%d0%bd%d1%8b%d1%85-%d0%b8%d0%b7%d0%be%d0%b1%d1%80%d0%b0%d0%b6%d0%b5%d0%bd%d0%b8%d0%b9-wiarpc",
    "description": "Запуск приложений, связанных с событиями загрузки неподвижных изображений.",
    "explained": "Служба, позволяющая сканерам определять тип сканируемого изображения за счёт простого нажатия определённой кнопки на сканере.",
    "recommendation": "Учитывая следующее:\nЕсли вы пользуетесь программой VueScan \n(а не той шляпой, которую предлагает производитель вашего сканера)\nМожете отключить службу."
  },
  "WbioSrvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b1%d0%b8%d0%be%d0%bc%d0%b5%d1%82%d1%80%d0%b8%d1%87%d0%b5%d1%81%d0%ba%d0%b0%d1%8f-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-windows",
    "description": "Биометрическая служба Windows предназначена для сбора, сравнения, обработки и хранения биометрических данных в клиентских приложениях без получения непосредственного доступа к биометрическим образцам или оборудованию. Эта служба размещается в привилегированном процессе SVCHOST.",
    "explained": "Служба, позволяющая разблокировать устройство с помощью ПИН-кода, по отпечаткам пальцев или с помощью системы распознавания лиц через приложение Windows Hello.",
    "recommendation": "Учитывая следующее:\nПользователи настольных ПК в здравом уме не будут использовать Windows Hello\nХотя Microsoft уверяет, что биометрические данные хранятся только на устройстве,\nистория показывает нам, как Microsoft с каждым обновлением Windows\nвнедряет новых скрытых шпионов\nРекомендуется отключить эту службу."
  },
  "RasAuto": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d0%b9-rasauto",
    "description": "Создает подключение к удаленной сети, когда программа обращается к удаленному DNS- или NetBIOS-имени или адресу.",
    "explained": "Служба, якобы отвечающая за автоматические удалённые подключения.",
    "recommendation": "Учитывая следующее:\nСлужба не нужна для Удалённого подключения, а также для Удалённого рабочего стола\nСлужбу нужно отключить."
  },
  "refsdedupsvc": {
    "error": true,
    "message": "Not found"
  },
  "SNMPTrap": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bb%d0%be%d0%b2%d1%83%d1%88%d0%ba%d0%b0-snmp",
    "description": "Принимает сообщения перехвата, созданные локальными или удаленными агентами SNMP и пересылает их программам управления SNMP, запущенными на этом компьютере. Если эта служба остановлена, программы на основе SNMP на данном компьютере перестанут получать сообщения перехвата. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Служба, необходимая системному администратору для уведомления об изменениях конфигурации на сетевых компьютерах.",
    "recommendation": "Учитывая следующее:\nЕсли у вас обычный компьютер или просто локальная сеть\nСлужбу можно отключить."
  },
  "PlugPlay": {
    "url": "https://win10tweaker.ru/twikinarium/services/plug-and-play",
    "description": "Позволяет компьютеру распознавать изменения в установленном оборудовании и подстраиваться под них, либо не требуя вмешательства пользователя, либо сводя его к минимуму. Остановка или отключение этой службы может привести к нестабильной работе системы.",
    "explained": "Служба необходима для автоматического определения подключённых к компьютеру устройств. Если устройство поддерживает Plug and Play, то Windows, при подключении такого устройства, сразу же отображает устройство в соответствии с его назначением. Например, флэшку сразу принимает за флэшку, принтер не торопится показывать, сначала подбирает драйверы, потом отображает устройство как принтер.",
    "recommendation": "Учитывая следующее:\nБольшинство устройств работают по технологии Plug and Play\nБез этой службы устройство не сможет идентифицироваться в системе\nСлужбу трогать не рекомендуется."
  },
  "RmSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-%d1%80%d0%b0%d0%b4%d0%b8%d0%be",
    "description": "Служба управления радио и режима \"в самолете\"",
    "explained": "Служба, отвечающая за включение и отключение режима В самолете.",
    "recommendation": "Учитывая следующее:\nЕсли у вас настольный компьютер\nЕсли у вас не Windows 11\nМожете отключить службу.\nВ противном случае, на ноутбуках, вы не сможете выйти из режима В самолете, если отключите службу.\nПридётся включать её обратно и делать перезагрузку.\nА на Windows 11 вы потеряете значок сети."
  },
  "sppsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b7%d0%b0%d1%89%d0%b8%d1%82%d0%b0-%d0%bf%d1%80%d0%be%d0%b3%d1%80%d0%b0%d0%bc%d0%bc%d0%bd%d0%be%d0%b3%d0%be-%d0%be%d0%b1%d0%b5%d1%81%d0%bf%d0%b5%d1%87%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Разрешает скачивание, установку и принудительное применение цифровых лицензий для Windows и приложений Windows. Если служба отключена, возможно, операционная система и лицензированные приложения будут работать в режиме уведомления. Настоятельно рекомендуется не отключать службу защиты программного обеспечения.",
    "explained": "Служба, кратковременно запускающаяся при старте Windows, проверяющая лицензии продуктов Microsoft, включая лицензию самой Windows.",
    "recommendation": "Учитывая следующее:\nСлужба касается активации Windows\nСлужбу нельзя отключать.\nВ противном случае получите глюки интерфейса, связанные с активацией. То не будет активироваться, то будет писать, что активировано, но в другом месте нет, и т.д."
  },
  "AxInstSV": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d1%81%d1%82%d0%b0%d0%bd%d0%be%d0%b2%d1%89%d0%b8%d0%ba-activex-axinstsv",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "WalletService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%ba%d0%be%d1%88%d0%b5%d0%bb%d1%8c%d0%ba%d0%b0-walletservice",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "perceptionsimulation": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b8%d0%bc%d0%b8%d1%82%d0%b0%d1%86%d0%b8%d0%b8-%d0%b2%d0%be%d1%81%d0%bf%d1%80%d0%b8%d1%8f%d1%82%d0%b8%d1%8f-windows",
    "description": "Включает моделирование пространственного восприятия, управление виртуальной камерой и моделирование пространственного ввода.",
    "explained": "Служба, позволяющая имитировать проекты, в основе которых лежат голографические объекты.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете голограммы\nМожете отключить службу."
  },
  "WinRM": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d0%be%d0%b3%d0%be-%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-windows-ws-management",
    "description": "Служба удаленного управления Windows (WinRM) применяет протокол WS-Management для удаленного управления. WS-Management - стандартный протокол веб-служб для удаленного управления программным обеспечением и оборудованием. Служба WinRM прослушивает сеть на наличие запросов WS-Management и обрабатывает их. Для принятия сетевых запросов необходимо настроить службу WinRM с помощью средства командной строки \"winrm.cmd\" или через групповую политику. Служба WinRM предоставляет доступ к данным WMI и включает поддержку сбора событий. Работа службы необходима для сбора событий и подписки на события. Для передачи сообщений WinRM используются протоколы HTTP и HTTPS. Служба WinRM не зависит от служб IIS, однако по умолчанию использует тот же порт, что и IIS. Служба WinRM резервирует префикс URL-адреса /wsman. Для предотвращения конфликтов со службами IIS размещенные на IIS веб-сайты не должны использовать префикс URL-адреса /wsman.",
    "explained": "Служба, позволяющая выполнять удалённые команды на компьютерах локальной сети.",
    "recommendation": "Учитывая, что служба:\nне имеет зависимостей\nне нужна для Удалённого рабочего стола и Удалённого помощника\nпредставляет потенциальную опасность для домашних ПК из-за возможности\nвзлома локальной сети и дальнейшего выполнения удалённых команд\nСлужбу нужно отключить."
  },
  "QWAVE": {
    "url": "https://win10tweaker.ru/twikinarium/services/qwave",
    "description": "Quality Windows Audio Video Experience (qWave) - сетевая платформа для потоковой передачи аудио и видео в домашних сетях на основе IP-протокола. Платформа qWave обеспечивает более высокую производительность и надежность потоковой передачи аудио и видео, обеспечивая необходимое качество обслуживания сети для аудио- и видеоприложений. Платформа содержит механизмы управления доступом, отслеживания и принудительного выполнения, получения данных приложений и установки приоритета трафика.",
    "explained": "Служба необходима для того, чтобы обеспечить вас таким качеством звука и видео, которое тянет ваш компьютер в рамках качества локального сетевого соединения. Можно, конечно, обойтись и без этой службы, однако многие драйверы используют технологию qWAVE, входящую в состав службы, что действительно улучшает качество звука и видео. Технология работает как видеозвонок в WhatsApp. Когда качество плохое, картинка и звук ухудшаются, когда качество локальной сети хорошее для обеих сторон, звук и картинка отличные.",
    "recommendation": "Учитывая следующее:\nСлужба используется только в локальной сети\nНа глаз прироста нет вообще\nСлужба лезет во внешнюю сеть\nСлужбу можно отключить."
  },
  "PerfHost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%85%d0%be%d1%81%d1%82-%d0%b1%d0%b8%d0%b1%d0%bb%d0%b8%d0%be%d1%82%d0%b5%d0%ba%d0%b8-%d1%81%d1%87%d0%b5%d1%82%d1%87%d0%b8%d0%ba%d0%b0-perfhost",
    "description": "Позволяет удаленным пользователям и 64-разрядным процессам запрашивать счетчики производительности, предоставляемые 32-разрядными библиотеками.",
    "explained": "Служба, позволяющая 64-битным процессам запрашивать данные счётчиков производительности у 32-битных компонентов.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь счётчиками производительности\nМожете отключить службу."
  },
  "wisvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d1%80%d0%b5%d0%b4%d0%b2%d0%b0%d1%80%d0%b8%d1%82%d0%b5%d0%bb%d1%8c%d0%bd%d0%be%d0%b9-%d0%be%d1%86%d0%b5%d0%bd%d0%ba%d0%b8-windows",
    "description": "Предоставляет поддержку инфраструктуры для Программы предварительной оценки Windows. Чтобы Программа предварительной оценки Windows работала, эта служба должна быть включена.",
    "explained": "Служба, необходимая пользователям с зависимостью к обновлениям Windows. Microsoft представляет программу Windows 10 Insider Preview, в которой любой желающий может стать подопытным кроликом и тестировать ещё невышедшие функции Windows. Для общего функционала этой программы необходима служба.",
    "recommendation": "Учитывая следующее:\nЕсли вы не страдаете синдромом апдейтера Windows\nМожете отключить службу."
  },
  "VaultSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d1%83%d1%87%d0%b5%d1%82%d0%bd%d1%8b%d1%85-%d0%b4%d0%b0%d0%bd%d0%bd%d1%8b%d1%85",
    "description": "Обеспечивает защищенное хранение и извлечение учетных данных пользователей, приложений и служебных пакетов.",
    "explained": "Служба, необходимая для авторизации в Магазине Windows.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь Магазином Windows\n(или пользуетесь, но не логинитесь под учёткой Microsoft)\nМожете отключить эту службу."
  },
  "RpcSs": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d0%b9-%d0%b2%d1%8b%d0%b7%d0%be%d0%b2-%d0%bf%d1%80%d0%be%d1%86%d0%b5%d0%b4%d1%83%d1%80-rpc",
    "description": "Служба RPCSS — это диспетчер служб для COM- и DCOM-серверов. Она выполняет запросы активации объектов, разрешение экспортера объектов и распределенный сбор мусора для этих серверов. Если отключить или остановить эту службу, то программы, использующие COM или DCOM, будут работать неправильно. Отключать службу RPCSS не рекомендуется.",
    "explained": "Служба, отвечающая за взаимосвязь любого компонента Windows с любым другим.",
    "recommendation": "Учитывая следующее:\nОтключение службы выведет из строя всю логику Windows\nСлужбу нельзя отключать.\nОтключение службы приведёт к полному отключению всех служб, что сделает запуск Windows невозможным."
  },
  "wcncsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%be%d0%b1%d0%bd%d0%b0%d1%80%d1%83%d0%b6%d0%b5%d0%bd%d0%b8%d0%b5-ssdp",
    "description": "Обнаруживает сетевые устройства и службы, использующие протокол обнаружения SSDP, такие как устройства UPnP. Также объявляет устройства и службы SSDP, работающие на локальном компьютере. Если эта служба остановлена, обнаружение устройств, использующих SSDP, не будет выполняться. Если данная служба отключена, все явно зависящие от нее службы запустить не удастся.",
    "explained": "Служба, позволяющая устройствам в локальной сети не только светить своё присутствие, но и возможности, которыми эти устройства обладают с помощью \"виртуального роутера\". Телевизор, например, с Wi-Fi, вещает всем подряд, что может делиться изображением со своего экрана и даёт все инструкции к своему управлению, медиаприставка запускает будильник, Wi-Fi Direct передаёт файлы на телефон и обратно и т.д.",
    "recommendation": "Учитывая следующее:\nSSDP раздаёт ссылки на управление устройством без шифрования\nWi-Fi Direct всё равно либо не работает, либо работает через жопу на Windows 10 и отваливается\nВо избежание несанкционированного доступа к вашим устройствам из внешней сети, службу нужно отключить."
  },
  "TextInputManagementService": {
    "error": true,
    "message": "Not found"
  },
  "SamSs": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d1%83%d1%87%d0%b5%d1%82%d0%bd%d1%8b%d1%85-%d0%b7%d0%b0%d0%bf%d0%b8%d1%81%d0%b5%d0%b9-samss",
    "description": "Запуск этой службы служит для других служб сигналом о том, что диспетчер учетных записей безопасности (SAM) готов к приему запросов. При отключении данной службы другие службы в системе не получат уведомления о готовности SAM, что в свою очередь может помешать корректному запуску этих служб. Не следует отключать эту службу.",
    "explained": "Перед тем, как какая-нибудь служба выполнит то, что ей нужно выполнить в групповой политике безопасности, она должна проверить, а работает ли служба, отвечающая за эту групповую политику. Ну, мало ли. И вот чтобы это проверить, существует один источник, который ответит на этот вопрос – Диспетчер учетных записей безопасности.",
    "recommendation": "Учитывая следующее:\nОт этой службы зависят все настройки профиля пользователя\n+ все локальные политики безопасности\nСлужбу нельзя отключать."
  },
  "WlanSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b0%d0%b2%d1%82%d0%be%d0%bd%d0%b0%d1%81%d1%82%d1%80%d0%be%d0%b9%d0%ba%d0%b8-wlan",
    "description": "Служба WLANSVC предоставляет логику, необходимую для настройки, обнаружения, подключения и отключения локальных беспроводных сетей согласно стандартам IEEE 802.11. Также она содержит логику для превращения компьютера в программную точку доступа, в результате чего другие устройства или компьютеры смогут подключаться к вашему компьютеру с помощью адаптера беспроводной сети, который поддерживает подобную функцию. Остановка или отключение службы WLANSVC приведет к тому, что все адаптеры беспроводных сетей на этом компьютеры станут недоступными из раздела пользовательского интерфейса Windows, отвечающего за управление сетью. Настоятельно рекомендуется запустить и не останавливать службу WLANSVC, если к компьютеру подключен адаптер беспроводной сети.",
    "explained": "Основная Wi-Fi-служба, благодаря которой работает всё, что связано с Wi-Fi.",
    "recommendation": "Учитывая следующее:\nЕсли ваш настольный компьютер или ноутбук имеют проводные подключения\nМожете отключить службу.Однако помните – вам нельзя отключать службу, если вы подключены по Wi-Fi или приспичит когда-нибудь воспользоваться Wi-Fi адаптером, либо сканировать беспроводные точки доступа. В общем и целом, после отключения службы автонастройки WLAN, всё, что связано с Wi-Fi, вам будет недоступно."
  },
  "SstpSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-sstp",
    "description": "Обеспечивает поддержку протокола SSTP (Secure Socket Tunneling Protocol) для подключения к удаленным компьютерам с помощью VPN. Если эта служба отключена, пользователи не смогут использовать SSTP для доступа к удаленным серверам.",
    "explained": "Служба обеспечивает шифрование трафика во время удалённого подключения к компьютерам через VPN.",
    "recommendation": "Учитывая следующее:\nСлужба запускается только при наличии VPN-соединений / Защищённых соединений между устройствами\nНекоторые VPN-клиенты пользуются этой службой\nМожете отключить службу, но лучше просто оставить её Вручную.\nОтключение службы ничему не навредит, однако ваш трафик перестанет шифроваться."
  },
  "UmRdpService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d1%80%d0%b0%d0%b1%d0%be%d1%87%d0%b8%d1%85-%d1%81%d1%82%d0%be%d0%bb%d0%be%d0%b2",
    "description": "Разрешает пользователям интерактивное подключение к удаленному компьютеру. Удаленный рабочий стол и сервер, обслуживающий сеансы подключения к удаленному рабочему столу, зависят от данной службы. Чтобы запретить удаленное использование данного компьютера, необходимо открыть панель управления, дважды щелкнуть компонент \"Свойства системы\" и затем на вкладке \"Удаленный доступ\" снять соответствующие флажки.",
    "explained": "Главная служба, отвечающая за удалённое управление рабочим столом.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь удалённым рабочим столом\nили пользуетесь, но подключаться будете только вы (не нужно, чтобы к вам)\nМожете отключить службу.\nЭто также отключит Перенаправитель портов, который вашему главному компьютеру тоже ни к чему."
  },
  "AarSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "WManSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-windows",
    "description": "Выполняет управление, включая действия по инициализации и регистрации",
    "explained": "Служба-посредник между прошлой, в которой обнаружены уязвимости нулевого дня и самой системой Windows.",
    "recommendation": "Учитывая следующее:\nСлужба не помогает и не мешает управлению с повышенными привилегиями\nМожете отключить службу."
  },
  "PolicyAgent": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b0%d0%b3%d0%b5%d0%bd%d1%82-%d0%bf%d0%be%d0%bb%d0%b8%d1%82%d0%b8%d0%ba%d0%b8-ipsec",
    "description": "Безопасность протокола IP (IPsec) поддерживает проверку подлинности кэширующих узлов на сетевом уровне, проверку подлинности источника данных, проверку целостности данных, их конфиденциальность (шифрование) и защиту повторения. Эта служба вводит в действие политики IPsec, созданные с помощью оснастки \"Политики IP-безопасности\" или средством командной строки \"netsh ipsec\". Остановка этой службы может привести к возникновению проблем с сетевыми подключениями, если политика требует, чтобы соединения использовали IPsec. Кроме того, если остановлена эта служба, то удаленное управление брандмауэром Защитника Windows недоступно.",
    "explained": "Служба занимается проверкой подлинности каналов связи между этими самыми каналами связи, по самому старому протоколу, изобретённому в тысяча девятьсот лохматом году под названием IPsec.",
    "recommendation": "Учитывая следующее:\nСлужба устарела и никем не используется\nЕсли вы не используете VPN-клиенты\nРекомендуется отключить эту службу."
  },
  "SecurityHealthService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b1%d0%b5%d0%b7%d0%be%d0%bf%d0%b0%d1%81%d0%bd%d0%be%d1%81%d1%82%d1%8c-windows",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "ShellHWDetection": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%be%d0%bf%d1%80%d0%b5%d0%b4%d0%b5%d0%bb%d0%b5%d0%bd%d0%b8%d0%b5-%d0%be%d0%b1%d0%be%d1%80%d1%83%d0%b4%d0%be%d0%b2%d0%b0%d0%bd%d0%b8%d1%8f-%d0%be%d0%b1%d0%be%d0%bb%d0%be%d1%87%d0%ba%d0%b8",
    "description": "Предоставляет уведомления для событий автозапуска на различных устройствах.",
    "explained": "Служба, позволяющая определять тип подключённого к компьютеру устройства, чтобы предлагать связанные с этим устройством действия в окне Автозапуска.",
    "recommendation": "Учитывая следующее:\nЛюди в здравом уме отключают Автозапуск\nСлужбу нужно отключить.\nДополнительно рекомендуется отключить сам Автозапуск съёмных носителей в Win 10 Tweaker ➜ Система.Однако, важно понимать, что на некоторых ноутбуках, к примеру Asus, отключение этой службы приведёт к невозможности использовать комбинации клавиш с Fn. Также, побочным действием отключения службы будет отсутствие уникальных иконок съёмных дисков. Это ни на что не влияет и отключение опции BitLocker."
  },
  "XboxGipSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/xbox-accessory-management-service",
    "description": "This service manages connected Xbox Accessories.",
    "explained": "Служба необходима для корректного определения необходимых для Xbox приблуд.",
    "recommendation": "Учитывая следующее:\nВы не используете Xbox\nРекомендуется отключить эту службу."
  },
  "PrintDeviceConfigurationService": {
    "error": true,
    "message": "Not found"
  },
  "ProfSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d1%80%d0%be%d1%84%d0%b8%d0%bb%d0%b5%d0%b9-%d0%bf%d0%be%d0%bb%d1%8c%d0%b7%d0%be%d0%b2%d0%b0%d1%82%d0%b5%d0%bb%d0%b5%d0%b9",
    "description": "Эта служба отвечает за загрузку и выгрузку профилей пользователей. Если эту службу остановить или отключить, пользователи не смогут входить в систему и выходить из нее, в приложениях могут возникать проблемы при обращении к данным пользователей, а компоненты, зарегистрированные для получения уведомлений о событиях профилей, не будут их получать.",
    "explained": "Служба, отвечающая за загрузку профилей пользователей (и локальные, и Microsoft) при включении компьютера.",
    "recommendation": "Учитывая следующее:\nУ службы серьёзные зависимости\nОтключение службы приведёт к бесконечной загрузке профиля\nСлужбу нельзя отключать."
  },
  "BluetoothUserService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "Spooler": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%b5%d1%80%d0%b5%d0%bd%d0%b0%d0%bf%d1%80%d0%b0%d0%b2%d0%b8%d1%82%d0%b5%d0%bb%d1%8c-%d0%bf%d0%be%d1%80%d1%82%d0%be%d0%b2-umrdpservice",
    "description": "Позволяет выполнить перенаправление принтеров, драйверов или портов для подключений к удаленному рабочему столу",
    "explained": "Служба, позволяющая запускать Печать в удалённом сеансе даже, когда у удалённого компьютера нет драйверов для Печати, с помощью перенаправления данных на основной компьютер, с которого выполняется сеанс удалённого рабочего стола. Служба также \"перенаправляет\" звук с удалённого компьютера на тот, с которого вы им управляете. То есть слышите звуки событий удалённого компьютера через сеанс Удалённого рабочего стола.",
    "recommendation": "Учитывая следующее:\nЛюбая инициализация принтера по сети требует драйвер\nЛюбой драйвер на удалённом компьютере предпочтительнее, чем зависимость от главного компьютера\nЗвуки с удалённого компьютера не столь важны (или нет?)\nУ вас не Windows Server (отключение этой службы сделает недоступным RDP на Windows Server)\nСлужбу можно отключить.\nОднако помните, чтобы получать звуки с удалённого компьютера, нужно, чтобы на нём (на удалённом компьютере) служба не была отключена.\nНа том компьютере, на который никто не будет заходить, лучше отключить службу."
  },
  "RemoteRegistry": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d0%b9-%d1%80%d0%b5%d0%b5%d1%81%d1%82%d1%80",
    "description": "Позволяет удаленным пользователям изменять параметры реестра на этом компьютере. Если эта служба остановлена, реестр может быть изменен только локальными пользователями, работающими на этом компьютере. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Служба, позволяющая администрировать системный реестр с помощью удалённого доступа.",
    "recommendation": "Учитывая следующее:\nСлужба потенциально опасна для домашнего компьютера \nСлужбу нужно оставить на Отключена.\nЕсли вы всё же будете пользоваться Удалённым реестром, то включать его нужно только на том компьютере, к которому соединяетесь."
  },
  "CDPUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "SharedAccess": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%be%d0%b1%d1%89%d0%b8%d0%b9-%d0%b4%d0%be%d1%81%d1%82%d1%83%d0%bf-%d0%ba-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d1%8e-ics",
    "description": "Предоставляет службы трансляции сетевых адресов, адресации, разрешения имен и службы предотвращения вторжения для домашней сети или сети небольшого офиса.",
    "explained": "Служба, позволяющая заплесневевшим компьютерам из локальной сети использовать интернет главного компьютера.",
    "recommendation": "Если вы:\nне используете виртуальные машины, созданные с помощью Hyper-V\nне имеете в локальной сети нет компьютеры на Windows 98/XP\nне планируете раздавать интернет с компьютера на телефон с помощью Windows Mobile Hotspot\nМожете отключить службу"
  },
  "wlidsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%be%d0%bc%d0%be%d1%89%d0%bd%d0%b8%d0%ba-%d0%bf%d0%be-%d0%b2%d1%85%d0%be%d0%b4%d1%83-%d0%b2-%d1%83%d1%87%d0%b5%d1%82%d0%bd%d1%83%d1%8e-%d0%b7%d0%b0%d0%bf%d0%b8%d1%81%d1%8c",
    "description": "Включение входа в систему на основе служб удостоверений учетных записей Майкрософт. Если эта служба остановлена, пользователи не смогут входить на компьютер с помощью своих учетных записей Майкрософт.",
    "explained": "Служба, отвечающая за авторизацию программ в сервисах Microsoft, а также за создание локальной учётной записи.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь продуктами Microsoft, где требуется авторизация учётной записи Microsoft\nЕсли вы не пользуетесь Магазином Windows\nЕсли вы не собираетесь создавать другие учётные записи / уже создали их\nМожете отключить службу.Помните, что для авторизации в Магазине Windows вам потребуется эта служба.\nИначе при входе вы увидите ошибку 0x800706D9."
  },
  "CloudBackupRestoreSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "Wcmsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d0%b9-windows",
    "description": "Принимает решения об автоматическом подключении или отключении, исходя из доступных для ПК параметров подключения к сети, и позволяет управлять подключениями к сети с помощью параметров групповой политики.",
    "explained": "Служба, отвечающая за все типы сетевых подключений и всё сетевое на вашем компьютере: Wi-Fi, VPN, Ethernet, Bluetooth, Интернет в целом и т.д.",
    "recommendation": "Учитывая следующее:\nБез этой службы не будет работать Интернет и прочие сетевые подключения\nСлужбу нельзя отключать."
  },
  "ScDeviceEnum": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%b5%d1%80%d0%b5%d1%87%d0%b8%d1%81%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-%d1%81%d0%bc%d0%b0%d1%80%d1%82-%d0%ba%d0%b0%d1%80%d1%82",
    "description": "Создает узлы программного устройства для всех устройств чтения смарт-карт, доступных в указанном сеансе. Если эта служба отключена, перечисление устройств чтения смарт-карт API-интерфейсами WinRT будет недоступно.",
    "explained": "Служба, необходимая плиточным приложениям из Магазина Windows, чтобы те могли получать доступ к смарт-картам, если это необходимо.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете смарт-карты\nМожете отключить службу."
  },
  "wercplsupport": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%be%d0%b4%d0%b4%d0%b5%d1%80%d0%b6%d0%ba%d0%b0-%d1%8d%d0%bb%d0%b5%d0%bc%d0%b5%d0%bd%d1%82%d0%b0-%d0%bf%d0%b0%d0%bd%d0%b5%d0%bb%d0%b8-wercplsupport",
    "description": "Эта служба обеспечивает просмотр, отправку и удаление отчетов о проблемах системного уровня для элемента панели управления \"Отчеты о проблемах и их решениях\".",
    "explained": "Менеджер просмотра и анализа системных ошибок.",
    "recommendation": "Учитывая следующее:\nМенеджер не исправляет ошибки\nУ службы нет зависимостей\nСлужбу можно отключить."
  },
  "TrustedInstaller": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%86%d0%b5%d0%bd%d1%82%d1%80-%d0%be%d0%b1%d0%b5%d1%81%d0%bf%d0%b5%d1%87%d0%b5%d0%bd%d0%b8%d1%8f-%d0%b1%d0%b5%d0%b7%d0%be%d0%bf%d0%b0%d1%81%d0%bd%d0%be%d1%81%d1%82%d0%b8",
    "description": "Служба WSCSVC (центр безопасности Windows) следит за параметрами работоспособности системы безопасности и протоколирует их. В эти параметры входит состояние брандмауэра (включен или выключен), антивирусной программы (включена/выключена/устарела), антишпионской программы (включена/выключена/устарела), обновления Windows (автоматическая или ручная загрузка и установка обновлений), контроля учетных записей пользователей (включен или выключен) и параметры Интернета (рекомендованные или отличающиеся от рекомендованных). Служба предоставляет интерфейсы API COM для независимых поставщиков программных продуктов, позволяющие поставщикам налаживать взаимодействие своих продуктов со службой центра безопасности (регистрация и запись состояний продуктов). Пользовательский интерфейс компонента \"Безопасность и обслуживание\" использует эту службу для отображения предупреждений в панели задач и предоставления графического отображения состояний работоспособности системы безопасности в панели управления компонента \"Безопасность и обслуживание\". Защита доступа к сети (NAP) использует данную службу для протоколирования состояний работоспособности системы безопасности клиентов и передачи их на сервер политики сети NAP с целью принятия решений о помещении в карантин. У данной службы также есть публичный API, позволяющий внешним потребителям программно получать сводные данные о состоянии работоспособности системы безопасности.",
    "explained": "Служба, якобы следящая за безопасностью Windows, на самом деле следящая за включённым состоянием всех Защитников, SmartScreen и прочей ереси, а также информирующая о том, что компьютер небезопасно использовать без плацебо от Microsoft.",
    "recommendation": "Учитывая следующее:\nЕсли вы в состоянии сами себя защищать без красненьких табличек-пугалочек\nМожете отключить службу с помощью супердоступа в Win 10 Tweaker Командой:\ncmd.exe /c sc config wscsvc start=disabled & sc stop wscsvc"
  },
  "CredentialEnrollmentManagerUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "swprv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bc%d0%be%d0%b4%d1%83%d0%bb%d1%8f-%d0%b0%d1%80%d1%85%d0%b8%d0%b2%d0%b0%d1%86%d0%b8%d0%b8-wbengine",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "PenService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "WdiSystemHost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%b7%d0%b5%d0%bb-%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d1%8b-%d0%b4%d0%b8%d0%b0%d0%b3%d0%bd%d0%be%d1%81%d1%82%d0%b8%d0%ba%d0%b8",
    "description": "Узел системы диагностики используется службой политики диагностики для размещения средств диагностики, запускаемых в контексте локальной системы. Если остановить эту службу, некоторые средства диагностики, зависящие от нее, не смогут работать.",
    "explained": "Служба, создающая видимость пользы диагностики компьютера на уровне операционной системы.",
    "recommendation": "Учитывая следующее:\nСлужба расходует ресурсы\nСлужба не несёт пользы\nСлужбу нужно отключить."
  },
  "wmiApSrv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b0%d0%b4%d0%b0%d0%bf%d1%82%d0%b5%d1%80-%d0%bf%d1%80%d0%be%d0%b8%d0%b7%d0%b2%d0%be%d0%b4%d0%b8%d1%82%d0%b5%d0%bb%d1%8c%d0%bd%d0%be%d1%81%d1%82%d0%b8-wmi",
    "description": "Предоставляет сведения библиотеки производительности от поставщиков инструментария управления Windows (WMI) клиентам сети. Эта служба доступна только при активации модуля поддержки данных производительности.",
    "explained": "Служба, занимающаяся анализом производительности компьютера, которая по умолчанию просто сидит и анализирует. Можно настроить службу таким образом, чтобы системный администратор был оповещён о слабой производительности ПК на предприятии. Но если у системного администратора хватит навыков сделать это, то скорее всего он будет пользоваться другими инструментами.",
    "recommendation": "Учитывая следующее:\nСобаке не нужна пятая нога\nСлужбу рекомендуется отключить."
  },
  "SessionEnv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bd%d0%b0%d1%81%d1%82%d1%80%d0%be%d0%b9%d0%ba%d0%b0-%d1%81%d0%b5%d1%80%d0%b2%d0%b5%d1%80%d0%b0-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d1%80%d0%b0%d0%b1%d0%be%d1%87%d0%b8%d1%85",
    "description": "Служба настройки сервера удаленных рабочих столов (RDCS) отвечает за все действия, связанные с настройкой и обслуживанием сеансов служб удаленных рабочих столов и удаленного доступа, для которых необходим контекст SYSTEM. Это касается временных папок сеансов, тем и сертификатов удаленных рабочих столов.",
    "explained": "Служба, отвечающая за серверную настройку удалённых рабочих столов.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете серверное подключение к удалённым рабочим столам\nМожете отключить службу."
  },
  "TimeBrokerSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b1%d1%80%d0%be%d0%ba%d0%b5%d1%80-%d0%b2%d1%80%d0%b5%d0%bc%d0%b5%d0%bd%d0%b8",
    "description": "Координирует выполнение фоновой работы для приложения WinRT. Если эта служба остановлена или отключена, фоновую работу невозможно инициировать.",
    "explained": "Служба необходимая для того, чтобы UWP-приложения из Магазина Windows могли работать в фоне.",
    "recommendation": "Учитывая следующее:\nНесмотря на то, что зависимостей якобы нет, это не так:\nПланировщик заданий напрямую зависит от Брокера времени\nСлужбу отключать нельзя. Нужно оставить Вручную. Если отключите службу, Планировщик заданий не запустится. А если не запустится он, то не будет работать Обслуживание дисков. А если Обслуживание дисков не будет работать, то не будет работать дефрагментация HDD и оптимизация SSD, а если не будут работать они, то Просмотр событий будет забиваться ещё большей кучей мусорных логов..."
  },
  "TokenBroker": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d1%83%d1%87%d0%b5%d1%82%d0%bd%d1%8b%d1%85-%d0%b2%d0%b5%d0%b1-%d0%b7%d0%b0%d0%bf%d0%b8%d1%81%d0%b5%d0%b9",
    "description": "Эта служба используется диспетчером учетных веб-записей для однократного входа в приложения и службы.",
    "explained": "Служба, необходимая тем, кто использует Магазин Windows. С помощью этой службы некоторые UWP-приложения запрашивают определённые права на определённый доступ. Эта служба, как видно из имени, является также брокером и отвечает также за сохранение аватара для вашей учётной записи в Windows и за отображение статуса активации Windows.",
    "recommendation": "Учитывая следующее:\nВы не пользуетесь Магазином Windows\nВы уже установили аватар\n(или не собираетесь его ставить)\nВы не используете пароли на вход в учётную запись, включая Microsoft Office\nМожете отключить эту службу.\nПри отключённой службе и попытке установить собственный аватар в Windows вы получите ошибку 0x80070422 и ошибку стекового буфера при посещении некоторых плиточных настроек, если Вы к ним вообще обращаетесь."
  },
  "P9RdrService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "WFDSConMgrSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d0%b9-wi-fi-direct",
    "description": "Управляет подключениями к беспроводным службам, в том числе службам беспроводного отображения и стыковки.",
    "explained": "Служба, позволяющая \"общаться\" двум устройствам по Wi-Fi без настроек локальной сети и роутера. Чаще всего применяется для подключения беспроводного монитора к компьютеру. Также можно передавать картинку с компьютера под управлением Windows на телевизор, если у второго есть функция Wi-Fi Direct (то самое взаимодействие двух устройств напрямую друг с другом без участия роутера).",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Wi-Fi Direct\nЕсли вы не используете подключение к беспроводному дисплею\nМожете отключить службу.Побочные эффекты от отключенияНе смотря на присутствующее Wi-Fi в названии службы, а также дважды упомянутое слово беспроводные в оригинальном описании, без этой службы не будет выскакивать панель проецирования экранов, даже когда у вас проводное подключение. Так или иначе, свой второй монитор вы всегда сможете добавить, как это делали все и всегда – через Параметры. Просто по горячей клавише Win+P панель не будет появляться."
  },
  "WarpJITSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/warpjitsvc",
    "description": "Provides a JIT out of process service for WARP when running with ACG enabled.",
    "explained": "Когда у вас включён Защитник Windows и, в частности, сопутствующая псевдозащита в браузере EDGE, служба WarpJITSvc перехватывает скрипты, которые должен обработать ваш процессор, компилирует эти скрипты в реальном времени в своей безопасной среде, проверяет их на вирусы и только потом конвертирует результат обратно, чтобы отдать процессору.",
    "recommendation": "Учитывая следующее:\nОпытный пользователь не будет использовать предустановленный браузер\nEDGE использует двойную нагрузку на процессор за счёт компиляции в реальном времени\nСлужба приносит только мнимую безопасность Windows\nРекомендуется отключить эту службу.\nК слову, можете даже выпилить её Командой: sc delete WarpJITSvc\nБраузеры, включая EDGE и Internet Explorer, не перестанут от этого работать."
  },
  "WaaSMedicSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/windows-update-medic-service",
    "description": "Включает исправление и защиту компонентов Центра обновления Windows.",
    "explained": "Служба нужна, как реанимация службы Центра Обновлений Windows. То есть в Microsoft знают, что люди борются с Обновлениями и решили подкинуть борцам ещё службу. На случай, если и эта служба отключена пользователем, в силу вступает MoUSO Core Worker Process.",
    "recommendation": "Учитывая следующее:\nСлужба никому не нужна\nРекомендуется отключить эту службу Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\WaaSMedicSvc /v Start /t reg_dword /d 4 /fОднако никто и ничто не гарантирует вам, что он не включится снова... кроме Win 10 Tweaker."
  },
  "WebClient": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b2%d0%b5%d0%b1-%d0%ba%d0%bb%d0%b8%d0%b5%d0%bd%d1%82",
    "description": "Позволяет Windows-программам создавать, получать доступ и изменять файлы, хранящиеся в Интернете. Если эта служба остановлена, эти функции не доступны. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Эта служба предоставляет возможность удалённо управлять файлами через Общий доступ или с помощью WebDAV.",
    "recommendation": "Учитывая следующее:\nСлужба не зависит от других служб\nДругие службы не зависят от этой службы\nСлужбу можно отключить. Однако помните, что WebDAV работать не будет."
  },
  "ConsentUxUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "PrintWorkflowUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "MessagingService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "vmicshutdown": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b7%d0%b0%d0%b2%d0%b5%d1%80%d1%88%d0%b5%d0%bd%d0%b8%d1%8f-%d1%80%d0%b0%d0%b1%d0%be%d1%82%d1%8b-hyper-v",
    "description": "Она также предоставляет механизм завершения работы операционной системы этой виртуальной машины с помощью интерфейса управления физического компьютера.",
    "explained": "Служба, отвечающая за выключение виртуальной машины Microsoft.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь виртуальной машиной от Microsoft\nМожете отключить службу."
  },
  "COMSysApp": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d0%bd%d0%be%d0%b5-%d0%bf%d1%80%d0%b8%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d0%b5-com",
    "description": "Управление настройкой и отслеживанием компонентов COM+. Если данная служба остановлена, большинство компонентов COM+ не будет работать правильно. Если данная служба отключена, все явно зависящие от нее службы не смогут запуститься.",
    "explained": "Служба, отвечающая за работу компонентов COM+.",
    "recommendation": "Учитывая следующее:\nОтключение службы приведёт к множеству ошибок Windows\nОтключение службы приведёт к ошибкам работы компонентов COM+\nМного, что может пойти не так с работой с жёсткими дисками, с управлением дисков, некоторых .NET Framework, ActiveX, DirectX и прочих\nРекомендуется оставить эту службу Вручную."
  },
  "AppVClient": {
    "url": "https://win10tweaker.ru/twikinarium/services/microsoft-app-v-client",
    "description": "Manages App-V users and virtual applications",
    "explained": "Для сисадминов, которые сталкиваются с рутинной установкой и настройкой одного и того же ПО в организации, открывается перспектива развёртывания заранее приготовленных виртуализированных программ с уже настроенными параметрами и прочим дополнительным барахлом. Служба Microsoft App-V Client предназначена для поддержки такого рода ПО, как чтения, так и создания.",
    "recommendation": "Учитывая, что служба отключена по умолчанию, её можно не трогать."
  },
  "Dnscache": {
    "url": "https://win10tweaker.ru/twikinarium/services/dns-%d0%ba%d0%bb%d0%b8%d0%b5%d0%bd%d1%82",
    "description": "Служба DNS-клиента (dnscache) кэширует имена DNS и регистрирует полное имя этого компьютера. Если служба остановлена, разрешение имен DNS будет продолжаться, но результаты запросов имен DNS не будут кэшироваться, а имя компьютера не будет зарегистрировано. Если служба отключена, все явно зависящие от нее службы запустить не удастся.",
    "explained": "Все сайты в интернете имеют свои адреса (IP-адрес и доменный адрес). Когда вы открываете у себя в браузере какой-нибудь сайт, например, repack.me (доменный адрес), ваш компьютер должен откуда-то узнать, к какому IP-адресу обращаться, чтобы открыть вам доменный адрес repack.me. Вот ваш роутер и ломится каждый раз узнавать, какой IP-адрес принадлежит сайту repack.me. Узнаёт ваш роутер это из всеобщей базы DNS-сервера, который хранит информацию о каждом IP-адресе и доменном адресе. То есть именно DNS-сервер говорит вашему роутеру, что IP-адрес у сайта такой-то такой-то. Чтобы лишний раз не стучать в эту базу и сократить время ответа, Microsoft создали службу DNS-клиент (DNS Cache). То есть один раз запомнил (закэшировал адрес) и красота, теперь сайт будет открываться быстрее.",
    "recommendation": "Если ваш роутер тупанёт, что бывает абсолютно со всеми роутерами, то вы обнаружите, что какие-то сайты открываются, а какие-то нет. Особый дискомфорт вы будете испытывать с сайтами, которые постоянно меняют адреса, которые, например, блокирует ваше государство. Поэтому службу можно отключить и не париться с тем, что ответ от DNS-сервера не придёт. Какие-то миллисекунды всё равно на глаз роли не играют. Но вы должны помнить, что такие вещи как Домашняя сеть и Магазин Windows требуют работы этой службы. Без DNS-клиента они просто перестают работать. Также есть некоторые VPN-клиенты, которые сами не научились опрашивать DNS-сервер и требуют выполнения этой задачи от службы Windows. Поэтому рекомендация спорная. Однозначная рекомендация Отключить DNS-клиент имеет место только в том случае, если 1) у вас продвинутый VPN-клиент, 2) вы не используете Магазин Windows, 3) вы не используете Домашнюю сеть, 4) вы не используете Подключение к удалённому рабочему столу."
  },
  "W32Time": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b2%d1%80%d0%b5%d0%bc%d0%b5%d0%bd%d0%b8-windows",
    "description": "Управляет синхронизацией даты и времени на всех клиентах и серверах в сети. Если эта служба остановлена, синхронизация даты и времени не будет доступна. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Служба, онлайн синхронизирующая время на вашем устройстве.",
    "recommendation": "Учитывая следующее:\nСлужба запускается один раз за сеанс\nСлужба не запускается, если шарить по настройкам времени\nРекомендуется оставить службу Вручную."
  },
  "webthreatdefsvc": {
    "error": true,
    "message": "Not found"
  },
  "GoogleUpdaterService130.0.6679.0": {
    "error": true,
    "message": "Not found"
  },
  "DeviceInstall": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d1%81%d1%82%d0%b0%d0%bd%d0%be%d0%b2%d0%ba%d0%b8-%d1%83%d1%81%d1%82%d1%80%d0%be%d0%b9%d1%81%d1%82%d0%b2",
    "description": "Позволяет компьютеру распознавать изменения в установленном оборудовании и подстраиваться под них, либо не требуя вмешательства пользователя, либо сводя его к минимуму. Остановка или отключение этой службы может привести к нестабильной работе системы.",
    "explained": "Служба, которая запускается только при значительном изменении конфигурации подключённого устройства. Если взять к примеру микрофон, то его можно включать / выключать в настройках устройств, менять свойства, рабочую частоту и прочее. Служба на такие вещи не реагирует. Однако, если устройство попытается выполнить то, что потребует перезагрузки, чтобы изменения вступили в силу, данная служба, позволяет избежать этой самой перезагрузки и позволить устройству работать с новой конфигурацией. Служба часто спасает, когда идёт установка драйвера. Если раньше без перезагрузки обойтись было нельзя, то сейчас практически всегда можно.",
    "recommendation": "Учитывая следующее:\nСлужба запускается в исключительных случаях\nСлужбу лучше не трогать и оставить Вручную."
  },
  "TieringEngineService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d0%b5-%d1%83%d1%80%d0%be%d0%b2%d0%bd%d1%8f%d0%bc%d0%b8-%d1%85%d1%80%d0%b0%d0%bd%d0%b8%d0%bb%d0%b8%d1%89%d0%b0",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "bthserv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%be%d0%b4%d0%b4%d0%b5%d1%80%d0%b6%d0%ba%d0%b8-bluetooth",
    "description": "Служба Bluetooth поддерживает обнаружение и согласование удаленных устройств Bluetooth. Остановка или отключение этой службы может привести к сбоям в работе уже установленных устройств Bluetooth, а также к невозможности обнаружения и согласования новых устройств.",
    "explained": "Служба, отвечающая за обнаружение Bluetooth-устройств во время их поиска.",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет Bluetooth и не планируете его использовать в любом виде\nМожете отключить службу."
  },
  "WpcMonSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%80%d0%be%d0%b4%d0%b8%d1%82%d0%b5%d0%bb%d1%8c%d1%81%d0%ba%d0%b8%d0%b9-%d0%ba%d0%be%d0%bd%d1%82%d1%80%d0%be%d0%bb%d1%8c",
    "description": "Применяет родительский контроль к учетным записям детей в Windows. Если эта служба остановлена или отключена, родительский контроль применить невозможно.",
    "explained": "Служба родительского контроля, которая не работает.",
    "recommendation": "Учитывая следующее:\nСлужба не работает\nСлужбу нужно отключить."
  },
  "WMPNetworkSvc": {
    "error": true,
    "message": "Not found"
  },
  "wlpasvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%be%d0%bc%d0%be%d1%89%d0%bd%d0%b8%d0%ba%d0%b0-wlpasvc",
    "description": "Эта служба обеспечивает управление профилями для модулей удостоверений подписчика",
    "explained": "Экспериментальная, недоделанная, неиспользуемая, мусорным способом оставленная служба. Была запланирована для получения сертификатов с вашего смартфона для использования звонков с Компьютера.",
    "recommendation": "Учитывая следующее:\nСлужба не работает\nМожете отключить службу."
  },
  "SystemEventsBroker": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b1%d1%80%d0%be%d0%ba%d0%b5%d1%80-%d1%81%d0%b8%d1%81%d1%82%d0%b5%d0%bc%d0%bd%d1%8b%d1%85-%d1%81%d0%be%d0%b1%d1%8b%d1%82%d0%b8%d0%b9",
    "description": "Координирует выполнение фоновой работы для приложения WinRT. Если эта служба остановлена или отключена, фоновую работу невозможно инициировать.",
    "explained": "Служба необходима для журналирования событий плиточных приложений из Магазина Windows.",
    "recommendation": "Учитывая следующее:\nОт этой службы зависит Планировщик заданий\nСлужбу отключать нельзя. Нельзя даже ставить на Вручную. Да, она будет автоматом включаться сразу с Windows, но Планировщик заданий всё равно больше не запустится. А если не запустится Планировщик, то не будет работать Обслуживание дисков. А если Обслуживание дисков не будет работать, то не будет работать дефрагментация HDD и оптимизация SSD, а если не будут работать они, то Просмотр событий будет забиваться ещё большей кучей мусорных логов..."
  },
  "WerSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%80%d0%b5%d0%b3%d0%b8%d1%81%d1%82%d1%80%d0%b0%d1%86%d0%b8%d0%b8-%d0%be%d1%88%d0%b8%d0%b1%d0%be%d0%ba-windows",
    "description": "Разрешает отправку отчетов об ошибках в случае прекращения работы или зависания программы, а также разрешает доставку имеющихся решений проблем. Также разрешает создание журналов для служб диагностики и восстановления. Если эта служба остановлена, то могут не работать отчеты об ошибках и не отображаться результаты служб диагностики и восстановления.",
    "explained": "Служба, отвечающая за ведение журнала ошибок и дальнейшего её анализа. На практике никак не помогающая простому пользователю.",
    "recommendation": "Учитывая следующее:\nСлужба бесполезна для пользовательского опыта и бессильна перед проблемами программ\nМожете отключить службу."
  },
  "vmicvmsession": {
    "error": true,
    "message": "Not found"
  },
  "XboxNetApiSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b5%d1%82%d0%b5%d0%b2%d0%b0%d1%8f-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-xbox-live",
    "description": "Данная служба поддерживает программный интерфейс Windows.Networking.XboxLive.",
    "explained": "Основная служба игрового сервиса Xbox Live от Microsoft.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Xbox\nМожете отключить службу."
  },
  "Winmgmt": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b8%d0%bd%d1%81%d1%82%d1%80%d1%83%d0%bc%d0%b5%d0%bd%d1%82%d0%b0%d1%80%d0%b8%d0%b9-%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-windows",
    "description": "Предоставляет общий интерфейс и объектную модель для доступа к информации об управлении операционной системой, устройствами, приложениями и службами. После остановки данной службы многие Windows-приложения могут работать некорректно. При отключении данной службы зависимые от нее службы не смогут быть запущены.",
    "explained": "Служба обеспечивает информацией о всех службах Windows, устройствах и системных утилитах.",
    "recommendation": "Учитывая следующее:\nОт службы зависит отображение других служб\nОт службы зависит отображение свойств многих устройств\nОт службы зависит запуск системных утилит\nСлужбу нельзя отключать."
  },
  "WPDBusEnum": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%b5%d1%80%d0%b5%d1%87%d0%b8%d1%81%d0%bb%d0%b8%d1%82%d0%b5%d0%bb%d1%8f-wpdbusenum",
    "description": "Применяет групповую политику к съемным запоминающим устройствам. Разрешает приложениям, таким как проигрыватель Windows Media и мастер импорта рисунков, передавать и синхронизировать содержание при использовании съемных запоминающих устройств.",
    "explained": "Служба, позволяющая различным устройствам (не обязательно компьютерам) иметь возможность синхронизировать фото, музыку и видео с вашей библиотекой Проигрывателя Windows Media.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Проигрыватель Windows Media\nМожете отключить службу."
  },
  "AppReadiness": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b3%d0%be%d1%82%d0%be%d0%b2%d0%bd%d0%be%d1%81%d1%82%d1%8c-%d0%bf%d1%80%d0%b8%d0%bb%d0%be%d0%b6%d0%b5%d0%bd%d0%b8%d0%b9",
    "description": "Подготовка приложений к использованию при первом входе пользователя на компьютер или добавлении новых приложений.",
    "explained": "Служба необходима для того, чтобы замедлить загрузку Windows за счёт потраченного времени на подготовку к запуску плиточных приложений. К слову, что бы там служба ни подготавливала, запуск приложений выполняется с такой же скоростью, как обычно.",
    "recommendation": "Учитывая следующее:\nСлужба не зависит от других служб\nДругие службы не зависят от этой службы\nСлужба замедляет загрузку Windows\nВы не используете Windows Киоск\nСлужбу можно отключить. Это ускорит загрузку Windows и не повлияет на скорость запуска приложений."
  },
  "KMSEmulator": {
    "error": true,
    "message": "Not found"
  },
  "WpnService": {
    "error": true,
    "message": "Not found"
  },
  "LSM": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bb%d0%be%d0%ba%d0%b0%d0%bb%d1%8c%d0%bd%d1%8b%d1%85-%d1%81%d0%b5%d0%b0%d0%bd%d1%81%d0%be%d0%b2",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "NcaSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%be%d0%bc%d0%be%d1%89%d0%bd%d0%b8%d0%ba-%d0%bf%d0%be-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d1%8e-%d0%ba-%d1%81%d0%b5%d1%82%d0%b8",
    "description": "Вывод уведомления о состоянии DirectAccess для компонентов пользовательского интерфейса",
    "explained": "Служба, необходимая при диагностике состояния сети.",
    "recommendation": "Учитывая следующее:\nЕсли не помогает при неполадках\nСлужбу можно отключить или оставить Вручную. Сама она не запускается, когда всё в порядке."
  },
  "DeviceAssociationBrokerSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "WSAIFabricSvc": {
    "error": true,
    "message": "Not found"
  },
  "WwanSvc": {
    "error": true,
    "message": "Not found"
  },
  "CaptureService_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "cbdhsvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "BrokerInfrastructure": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b8%d0%bd%d1%84%d1%80%d0%b0%d1%81%d1%82%d1%80%d1%83%d0%ba%d1%82%d1%83%d1%80%d1%8b-%d1%84%d0%be%d0%bd%d0%be%d0%b2%d1%8b%d1%85-%d0%b7%d0%b0%d0%b4%d0%b0%d1%87",
    "description": "Служба инфраструктуры Windows, контролирующая возможность выполнения фоновых задач в системе.",
    "explained": "Служба, отвечающая за выполнение фоновых задач в Windows. В новых сборках Windows 10 служба Windows Search стала зависимой от этой службы, т.к. поиск теперь может выполняться в фоновом режиме не нагружая интерфейс Windows.",
    "recommendation": "Учитывая следующее:\nОт службы зависят фоновые задачи\nСлужбу нельзя отключать.\nОтключение службы приведёт к невозможности загрузиться на Рабочий стол, потому что уже тогда запускаются многие фоновые задачи, включая все задачи из Планировщика заданий."
  },
  "wuauserv": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%86%d0%b5%d0%bd%d1%82%d1%80-%d0%be%d0%b1%d0%bd%d0%be%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-windows",
    "description": "Включает обнаружение, скачивание и установку обновлений для Windows и других программ. Если эта служба отключена, пользователи данного компьютера не смогут использовать службу Центра обновления Windows либо возможности автоматического обновления и программы не смогут использовать API агента Центра обновления Windows (WUA).",
    "explained": "Служба, благодаря из-за которой загружаются и устанавливаются обновления Windows и приложения из Магазина Windows.",
    "recommendation": "Учитывая следующее:\nЕсли вы не устанавливаете обновления\nЕсли вы не пользуетесь Магазином Windows\nМожете отключить службу.Отключение через Службы практически ничего не даст, потому что другие связанные процессы всё равно запустят службу обратно, однако, если вы отключите службу через Win 10 Tweaker, обновления гарантированно не пролезут и можно не обращать внимания на то, что служба вновь запускается. Толку от неё всё равно будет ноль. Win 10 Tweaker, при отключении службы, на корню пресекает любые попытки Windows загрузить обновления."
  },
  "DevicePickerUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "BTAGService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b7%d0%b2%d1%83%d0%ba%d0%be%d0%b2%d0%be%d0%b3%d0%be-%d1%88%d0%bb%d1%8e%d0%b7%d0%b0-bluetooth",
    "description": "Служба, поддерживающая роль звукового шлюза профиля беспроводной связи Bluetooth.",
    "explained": "Служба, позволяющая использовать звуковые шлюзы, например, телефонный разговор, через Bluetooth.",
    "recommendation": "Учитывая следующее:\nЕсли у вас настольный компьютер или ноутбук\nМожете отключить службу."
  },
  "UdkUserSvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "camsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%b4%d0%be%d1%81%d1%82%d1%83%d0%bf%d0%b0-%d0%ba-%d0%b2%d0%be%d0%b7%d0%bc%d0%be%d0%b6%d0%bd%d0%be%d1%81%d1%82%d1%8f%d0%bc-camsvc",
    "description": "Предоставляет средства для управления доступом приложений UWP к возможностям приложений и проверки доступа приложения к определенным возможностям приложений",
    "explained": "Служба занимается контролем доступа UWP-приложений и не только к возможностям Windows. Также отвечает за настройки доступа приложений к таким устройствам, как микрофон, веб-камера и прочие.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Магазин Windows\nЕсли вы не используете микрофон\nМожете отключить службу.Отключение службы не мешает авторизации в Магазине Windows и даже скачиванию приложений.\nОднако, после полной загрузки приложения, на этапе установки, вы получите ошибку 0x80070422.\nТакже, от службы зависит работа любых микрофонов."
  },
  "XblAuthManager": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b4%d0%b8%d1%81%d0%bf%d0%b5%d1%82%d1%87%d0%b5%d1%80-%d0%bf%d1%80%d0%be%d0%b2%d0%b5%d1%80%d0%ba%d0%b8-%d0%bf%d0%be%d0%b4%d0%bb%d0%b8%d0%bd%d0%bd%d0%be%d1%81%d1%82%d0%b8-xbox-live",
    "description": "Обеспечивает авторизацию и проверку подлинности во время взаимодействия с Xbox Live. При прекращении работы диспетчера в работе некоторых приложений может произойти сбой.",
    "explained": "Служба, авторизующая вас на игровом сервере Xbox Live.",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет Xbox\nМожно отключить службу. Отключение этой службы также отключит Службу сохранений игр Xbox."
  },
  "CertPropSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%80%d0%b0%d1%81%d0%bf%d1%80%d0%be%d1%81%d1%82%d1%80%d0%b0%d0%bd%d0%b5%d0%bd%d0%b8%d0%b5-%d1%81%d0%b5%d1%80%d1%82%d0%b8%d1%84%d0%b8%d0%ba%d0%b0%d1%82%d0%b0",
    "description": "Копирует сертификаты пользователя и корневые сертификаты со смарт-карты в хранилище сертификатов текущего пользователя, обнаруживает установку смарт-карт в устройство чтения смарт-карт и при необходимости устанавливает самонастраивающийся мини-драйвер смарт-карт.",
    "explained": "Обязательная служба смарт-карт, позволяющая устанавливать драйверы для смарт-карт и хранить корневые сертификаты смарт-карт (основные принципы авторизации смарт-карт).",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете смарт-карты\nМожете отключить службу."
  },
  "embeddedmode": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b2%d1%81%d1%82%d1%80%d0%be%d0%b5%d0%bd%d0%bd%d1%8b%d0%b9-%d1%80%d0%b5%d0%b6%d0%b8%d0%bc",
    "description": "Служба \"Встроенный режим\" позволяет выполнять сценарии, относящиеся к фоновым приложениям. Если отключить эту службу, фоновые приложения не будут активироваться.",
    "explained": "Служба, необходимая UWP-приложениям для того, чтобы приложение могло быть свёрнуто или даже закрыто, но при этом могло выполнять фоновые задачи.",
    "recommendation": "Учитывая следующее:\nEDGE и Skype даже с отключённой службой работают в фоне\nСами приложения можно погружать в фон программно\nОт этой службы не зависят другие службы\nСлужбу можно отключить следующей Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\embeddedmode /v Start /t reg_dword /d 4 /f"
  },
  "dcsvc": {
    "error": true,
    "message": "Not found"
  },
  "GraphicsPerfSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/graphicsperfsvc",
    "description": "Graphics performance monitor service",
    "explained": "Как следует из описания – это диспетчер производительности графики. Не стоит путать с графическим показателем производительности. Слово Графика тут играет роль в первую очередь.",
    "recommendation": "Учитывая следующее:\nДругие службы не зависят от этой службы\nСама служба не зависит от других служб\nСлужбу можно отключить, однако делать этого не рекомендуется, потому что служба вызывается только тогда, когда этого требует какое-то ПО."
  },
  "DsSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%81%d0%be%d0%b2%d0%bc%d0%b5%d1%81%d1%82%d0%bd%d0%be%d0%b3%d0%be-%d0%b4%d0%be%d1%81%d1%82%d1%83%d0%bf%d0%b0-%d0%ba-%d0%b4%d0%b0%d0%bd%d0%bd%d1%8b%d0%bc",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Учитывая, что служба:\nне нужна для локальной сети\nне нужна для работы через Удалённый рабочий стол (тому, кто подключается)\nне помогает / не мешает в вопросах привилегий на локальном компьютере\nМожете отключить службу.\nПосле отключения службы, попытка открыть снимок экрана, сделанный по Win+Shift+S, в программе Snip & Sketch приведёт к ошибке. Также без этой службы у вас не будет работать «Обрезка» видео в плиточном приложении Кино и ТВ (ошибка 0xc1130002)."
  },
  "CDPSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-cdpsvc-cdpusersvc",
    "description": "Эта служба используется в сценариях платформы подключенных устройств",
    "explained": "Служба-шпион, обрабатывающая пользовательские данные, отправляющая на серверы Microsoft в зашифрованном виде. Чтобы у пользователей не чесались руки отключать шпионов, Microsoft решила привязать функционал шпиона к следующим сервисам: Хронология, Виртуальные рабочие столы, приложение Ваш телефон и Ночной свет. С каждой новой сборкой Microsoft прикручивает к шпиону новую службу и сервис, поэтому следует обращаться к этой странице чаще. Она всегда актуальная.",
    "recommendation": "Если Вам не нужны: Хронология, Виртуальные рабочие столы, приложение Ваш телефон и Ночной свет, можете удалить службу Командой:\nsc delete CDPSvcОднако, если они вам нужны, рекомендуется перевести тип запуска службы на Вручную."
  },
  "cloudidsvc": {
    "error": true,
    "message": "Not found"
  },
  "EntAppSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%bf%d1%80%d0%b0%d0%b2%d0%bb%d0%b5%d0%bd%d0%b8%d1%8f-%d0%ba%d0%be%d1%80%d0%bf%d0%be%d1%80%d0%b0%d1%82%d0%b8%d0%b2%d0%bd%d1%8b%d0%bc%d0%b8-entappsvc",
    "description": "Обеспечивает управление корпоративными приложениями.",
    "explained": "Служба, позволяющая удалённо выполнять развёртывание и удаление плиточных приложений в локальной сети. Используется на серверных корпоративных компьютерах.",
    "recommendation": "Учитывая следующее:\nЕсли у вас персональный компьютер / ноутбук / планшет, не входящий в состав корпоративной сети\nМожете отключить службу Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\EntAppSvc /v Start /t reg_dword /d 4 /f"
  },
  "GoogleUpdaterService131.0.6776.0": {
    "error": true,
    "message": "Not found"
  },
  "lmhosts": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bc%d0%be%d0%b4%d1%83%d0%bb%d1%8c-%d0%bf%d0%be%d0%b4%d0%b4%d0%b5%d1%80%d0%b6%d0%ba%d0%b8-netbios-%d1%87%d0%b5%d1%80%d0%b5%d0%b7-tcp-ip",
    "description": "Осуществляет поддержку NetBIOS через службу TCP/IP (NetBT) и разрешение имен NetBIOS для клиентов в сети, позволяя пользователям получать общий доступ к файлам, принтерам, а также подключаться к сети. Если данная служба остановлена, эти функции могут быть недоступны. Если данная служба отключена, все явно зависящие от нее службы запустить не удастся.",
    "explained": "Служба, отвечающая за политику Общего доступа при прогулке по локальной сети. Если при отключённой службе Сервер, заходя в компьютер локальной сети вы видите ошибку, где ясно сказано, что нужна служба сервера, то в случае с Модулем поддержки NetBIOS вы видите неявную ошибку 0x80070035.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь локальной сетью.\nМожете отключить службу."
  },
  "fdPHost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%85%d0%be%d1%81%d1%82-%d0%bf%d0%be%d1%81%d1%82%d0%b0%d0%b2%d1%89%d0%b8%d0%ba%d0%b0-%d1%84%d1%83%d0%bd%d0%ba%d1%86%d0%b8%d0%b8-%d0%be%d0%b1%d0%bd%d0%b0%d1%80%d1%83%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "В службе FDPHOST размещаются поставщики обнаружения сетевых ресурсов компонента обнаружения функций. Эти поставщики обнаружения функций обеспечивают службы обнаружения сетевых ресурсов для протоколов SSDP и WS-D. Остановка или отключение службы FDPHOST приведет к отключению обнаружения сетевых ресурсов для этих протоколов при использовании обнаружения функций. Если эта служба недоступна, сетевые службы, работа которых зависит от компонента обнаружения функций и данных протоколов обнаружения, не смогут находить сетевые устройства или ресурсы.",
    "explained": "Служба, отвечающая за обнаружение текущего компьютера в сети. А вот отображением занимается  Публикация ресурсов обнаружения функции.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь локальной сетью\nМожете отключить службу."
  },
  "IKEEXT": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bc%d0%be%d0%b4%d1%83%d0%bb%d0%b8-%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%b9-ipsec",
    "description": "Служба IKEEXT содержит модули для работы с ключами в Интернете (IKE) и по протоколу IP с проверкой подлинности (AuthIP). Эти модули для работы с ключами используются при проверке подлинности и обмене ключами в протоколе безопасности IP (IPsec). Остановка или отключение службы IKEEXT ведет к отключению обмена ключами IKE и AuthIP с другими компьютерами. Как правило, IPsec настроен на использование IKE или AuthIP; таким образом, остановка или отключение службы IKEEXT может привести к сбою в работе IPsec и поставить под угрозу безопасность системы. Настоятельно рекомендуется, чтобы служба IKEEXT была включена.",
    "explained": "Служба управления компонентами в IPSec.",
    "recommendation": "Учитывая следующее:\nУ вас нет Xbox\nУ вас отключён Агент политики IPSec\nУ вас нет VPN-клиента\nМожете отключить службу."
  },
  "LanmanServer": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b5%d1%80%d0%b2%d0%b5%d1%80",
    "description": "Поддерживает общий доступ к файлам, принтерам и именованным каналам для данного компьютера через сетевое подключение. Если служба остановлена, такие функции не удастся выполнить. Если данная служба отключена, не удастся запустить любые явно зависимые службы.",
    "explained": "Базовая служба, отвечающая за компьютер, как за сервер. Чтобы к вашему компьютеру могли подключаться, он должен быть превращён в сервер. Как раз этим занимается служба Сервер. Даже если ваш компьютер не является главным сервером или вообще не должен быть сервером в общей локальной сети, без этой службы у вас не получится заглядывать на другие компьютеры в локальной сети. Новые версии Windows могут обойтись без этой службы, но разные \"десятки\" уже не факт, что смогут цепляться друг к другу без проблем.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете локальную сеть\nЕсли вы не используете свой компьютер для печати с других компьютеров\nМожете отключить эту службу."
  },
  "NVDisplay.ContainerLocalSystem": {
    "error": true,
    "message": "Not found"
  },
  "FDResPub": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%85%d0%be%d1%81%d1%82-%d0%bf%d0%be%d1%81%d1%82%d0%b0%d0%b2%d1%89%d0%b8%d0%ba%d0%b0-%d1%84%d1%83%d0%bd%d0%ba%d1%86%d0%b8%d0%b8-%d0%be%d0%b1%d0%bd%d0%b0%d1%80%d1%83%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "В службе FDPHOST размещаются поставщики обнаружения сетевых ресурсов компонента обнаружения функций. Эти поставщики обнаружения функций обеспечивают службы обнаружения сетевых ресурсов для протоколов SSDP и WS-D. Остановка или отключение службы FDPHOST приведет к отключению обнаружения сетевых ресурсов для этих протоколов при использовании обнаружения функций. Если эта служба недоступна, сетевые службы, работа которых зависит от компонента обнаружения функций и данных протоколов обнаружения, не смогут находить сетевые устройства или ресурсы.",
    "explained": "Служба, отвечающая за обнаружение текущего компьютера в сети. А вот отображением занимается  Публикация ресурсов обнаружения функции.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь локальной сетью\nМожете отключить службу."
  },
  "KeyIso": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b8%d0%b7%d0%be%d0%bb%d1%8f%d1%86%d0%b8%d1%8f-%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%b9-cng",
    "description": "Служба изоляции ключей CNG размещается в процессе LSA. Эта служба обеспечивает изоляцию процесса ключа для закрытых ключей и связанных операций криптографии, как того требуют общие критерии. Эта служба хранит и использует долгоживущие ключи в безопасном процессе в соответствии с требованиями общих критериев.",
    "explained": "Служба необходима для изоляции зашифрованной информации (приватных ключей) в отдельном процессе Windows (lsass) проверки подлинности. Напрямую служба не связана с криптографией, как таковой, а лишь обеспечивает долговечное хранение криптографической информации. Служба работает только для продуктов разработанных на основе криптографии.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете PIN-коды, отпечатки пальцев и распознавание лиц\nЕсли вы не используете VPN-клиенты\nЕсли вы не пользуетесь Microsoft Visual Studio и Microsoft Office\nЕсли вы не пользуетесь приложением Ваш телефон,\nкоторый попутно занимается шифрованием ваших данных через эту службу\nМожете отключить эту службу."
  },
  "LicenseManager": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-windows-license-manager",
    "description": "Обеспечивает поддержку инфраструктуры для Microsoft Store. Эта служба запускается по требованию и если она отключена, то содержимое, приобретенное в Microsoft Store, не будет функционировать должным образом.",
    "explained": "Служба, проверяющая лицензии приложений, загружаемых из Магазина Windows, а также отвечающая за запуск плиточных приложений.",
    "recommendation": "Учитывая следующее:\nЕсли вы не скачиваете приложения из Магазина Windows\nЕсли вы в принципе не пользуетесь плиточными приложениями\nМожете отключить службу.Отключение службы приведёт к мгновенному прекращению работы всех плиточных приложений (строго говоря, к невозможности запуска), а также к тому, что при попытке скачать приложения из Магазина Windows, вы получите ошибку 0x80070422, которая попросит вас включить Центр обновлений Windows.\nНичего общего эта служба с Центром обновления Windows не имеет, просто Microsoft забыли, какую службу связывали в прошлый раз и просто забыли придумать сознательную новую ошибку, оставив старую."
  },
  "fhsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b8%d1%81%d1%82%d0%be%d1%80%d0%b8%d0%b8-%d1%84%d0%b0%d0%b9%d0%bb%d0%be%d0%b2",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "Netman": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b5%d1%82%d0%b5%d0%b2%d1%8b%d0%b5-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "McpManagementService": {
    "url": "https://win10tweaker.ru/twikinarium/services/mcpmanagementservice",
    "description": "<Не удается прочитать описание. Код ошибки: 15100 >",
    "explained": "Служба, необходимая для облачного принтера.",
    "recommendation": "Учитывая следующее:\nПростому принтеру не нужна эта служба\nСлужбу можно отключить"
  },
  "IpxlatCfgSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bd%d0%b0%d1%81%d1%82%d1%80%d0%be%d0%b9%d0%ba%d0%b8-%d0%bf%d1%80%d0%b5%d0%be%d0%b1%d1%80%d0%b0%d0%b7%d0%be%d0%b2%d0%b0%d0%bd%d0%b8%d1%8f-ip",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "webthreatdefusersvc_42d4d": {
    "error": true,
    "message": "Not found"
  },
  "gpsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%ba%d0%bb%d0%b8%d0%b5%d0%bd%d1%82-%d0%b3%d1%80%d1%83%d0%bf%d0%bf%d0%be%d0%b2%d0%be%d0%b9-%d0%bf%d0%be%d0%bb%d0%b8%d1%82%d0%b8%d0%ba%d0%b8",
    "description": "Данная служба отвечает за применение параметров, настроенных администраторами для компьютеров и пользователей с помощью компонента \"Групповая политика\". Если эта служба отключена, параметры не будут применяться, а приложениями и компонентами будет невозможно управлять через групповую политику. В этом случае могут не работать компоненты или приложения, зависящие от компонента \"Групповая политика\".",
    "explained": "Служба, отвечающая за правила Групповой политики. Несмотря на то, что официально от службы не зависят другие службы, это не так. Правила Брандмауэра напрямую зависят от Клиента групповой политики.",
    "recommendation": "Учитывая следующее:\nОт службы зависит Брандмауэр и Групповая политика в целом\nСлужбу нельзя отключать.\nОтключение службы приведёт к тому, что правила Групповой политики будут игнорироваться, а Центр уведомлений при запуске Windows будет ругаться на то, что не удаётся подключиться к службе Групповой политики. Журнал ошибок будет постоянно сыпать отчётами об ошибках при вызове GPClient (Клиент групповой политики)."
  },
  "BITS": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%84%d0%be%d0%bd%d0%be%d0%b2%d0%b0%d1%8f-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%b5%d1%80%d0%b5%d0%b4%d0%b0%d1%87%d0%b8-bits",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "GameInputSvc": {
    "error": true,
    "message": "Not found"
  },
  "MSiSCSI": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b8%d0%bd%d0%b8%d1%86%d0%b8%d0%b0%d1%82%d0%be%d1%80%d0%b0-%d0%bc%d0%b0%d0%b9%d0%ba%d1%80%d0%be%d1%81%d0%be%d1%84%d1%82-iscsi",
    "description": "Управляет сеансами Интернет-SCSI (iSCSI) между компьютером и удаленными целевыми устройствами iSCSI. Если эта служба остановлена, компьютер не сможет выполнить вход в систему или получить доступ к целевым устройствам iSCSI. Если данная служба отключена, ни одну явно зависящую от нее службу запустить не удастся.",
    "explained": "Служба является ещё одним способом расшаривать по сети свои данные. В отличие от файлов и папок, с помощью этой службы и его клиента, вы можете расшаривать целые диски. В локальной сети они будут выглядеть точно так же, как встроенные в системник / ноутбук.",
    "recommendation": "Учитывая следующее:\nЕсли вы не собираетесь расшаривать свои диски целиком\nМожете отключить службу."
  },
  "msiserver": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%83%d1%81%d1%82%d0%b0%d0%bd%d0%be%d0%b2%d1%89%d0%b8%d0%ba-windows",
    "description": "Позволяет добавлять, изменять и удалять приложения, предоставленные пакетом установщика Windows (*.msi, *.msp). Если эта служба отключена, запуск любых явно зависящих от нее служб невозможен.",
    "explained": "Служба, отвечающая за установку, изменение и удаление программ и компонентов в формате msi и msp. Обёртку установщика программ (msi) придумали в Microsoft и пользуется ей, в основном, сама Microsoft, однако встречаются инсталляторы программ на основе msi от сторонних разработчиков. Имя msi было придумано в честь себя – Microsoft Installer.",
    "recommendation": "Учитывая следующее:\nСлужба запускается, только когда идёт обращение к msi и msp\nОт службы зависит установка, изменение и удаление системных компонентов\nСлужбу нельзя отключать."
  },
  "NgcSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-microsoft-passport-ngcsvc",
    "description": "Обеспечивает изоляцию процесса для ключей шифрования, используемых для проверки подлинности для связанных поставщиков удостоверений пользователя. Если эта служба отключена, все варианты использования этих ключей и управления ими не будут доступны, включая вход в систему компьютера и единый вход для приложений и веб-сайтов. Эта служба запускается и останавливается автоматически. Не рекомендуется перенастраивать эту службу.",
    "explained": "В отличие от основной службы Контейнера службы Microsoft Passport, эта служба обеспечивает надёжное хранение зашифрованных данных биометрии.",
    "recommendation": "Учитывая следующее:\nЕсли у вас домашний компьютер с простым входом (или паролем)\nЕсли вы не используете на входе отпечатки пальцев, распознавание лиц и смарт-карты\nМожете отключить службу Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\NgcSvc /v Start /t reg_dword /d 4 /f\nОтключение службы приведёт к тому, что устройства авторизации на вашем компьютере работать не будут.\nТакже авторизация по паролю в Магазине Windows будет вызывать ошибку 0x80070426."
  },
  "NgcCtnrSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%ba%d0%be%d0%bd%d1%82%d0%b5%d0%b9%d0%bd%d0%b5%d1%80-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-microsoft-passport",
    "description": "Управляет ключами удостоверений локального пользователя, используемыми для проверки подлинности пользователя для поставщиков удостоверений, а также виртуальными смарт-картами TPM. Если эта служба отключена, ключи удостоверений локального пользователя и виртуальные смарт-карты TPM будут недоступны. Рекомендуется не перенастраивать службу.",
    "explained": "Служба, необходимая для идентификации устройств, которые могут подтверждать вашу авторизацию. Например, если вы используете Windows в качестве кассы в торговом магазине или подтверждаете вход с помощью USB-ключа или смарт-карты (классическая пластиковая карта с чипом). Также от службы зависит работа Windows Hello (отпечатки пальцев, распознавание лиц)",
    "recommendation": "Учитывая следующее:\nЕсли у вас домашний компьютер с простым входом (или паролем)\nЕсли вы не используете на входе отпечатки пальцев, распознавание лиц и смарт-карты\n\nМожете отключить службу Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\NgcCtnrSvc /v Start /t reg_dword /d 4 /fОтключение службы приведёт к тому, что устройства авторизации на вашем компьютере работать не будут.\nТакже авторизация по паролю в Магазине Windows будет вызывать ошибку 0x80070426.Если вам нужна эта служба, но запускается она у вас Автоматически, вы можете ускорить запуск компьютера переключив Тип запуска на Вручную Командой:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Services\\NgcCtnrSvc /v Start /t reg_dword /d 3 /f"
  },
  "NlaSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%81%d0%b2%d0%b5%d0%b4%d0%b5%d0%bd%d0%b8%d0%b9-%d0%be-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d1%81%d0%b5%d1%82%d1%8f%d1%85",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "NaturalAuthentication": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d1%80%d0%be%d1%84%d0%b8%d0%bb%d0%b5%d0%b9-%d0%bf%d0%be%d0%bb%d1%8c%d0%b7%d0%be%d0%b2%d0%b0%d1%82%d0%b5%d0%bb%d0%b5%d0%b9",
    "description": "Эта служба отвечает за загрузку и выгрузку профилей пользователей. Если эту службу остановить или отключить, пользователи не смогут входить в систему и выходить из нее, в приложениях могут возникать проблемы при обращении к данным пользователей, а компоненты, зарегистрированные для получения уведомлений о событиях профилей, не будут их получать.",
    "explained": "Служба, отвечающая за загрузку профилей пользователей (и локальные, и Microsoft) при включении компьютера.",
    "recommendation": "Учитывая следующее:\nУ службы серьёзные зависимости\nОтключение службы приведёт к бесконечной загрузке профиля\nСлужбу нельзя отключать."
  },
  "MsKeyboardFilter": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%84%d0%b8%d0%bb%d1%8c%d1%82%d1%80%d0%b0%d1%86%d0%b8%d1%8f-%d0%ba%d0%bb%d0%b0%d0%b2%d0%b8%d0%b0%d1%82%d1%83%d1%80%d1%8b-microsoft-mskeyboardfilter",
    "description": "Управляет фильтрацией и сопоставлением нажатий клавиш",
    "explained": "Служба, которая позволяет отказаться от любых горячих клавиш, заложенных в Windows 10 и выше.",
    "recommendation": "Учитывая следующее:\nСлужба и так не работает\nСлужбу можно не трогать."
  },
  "iphlpsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b2%d1%81%d0%bf%d0%be%d0%bc%d0%be%d0%b3%d0%b0%d1%82%d0%b5%d0%bb%d1%8c%d0%bd%d0%b0%d1%8f-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-ip",
    "description": "Обеспечивает возможность туннельного подключения с помощью технологий туннелирования для IP версии 6 (6to4, ISATAP, порты прокси и Teredo), а также IP-HTTPS. Если остановить эту службу, компьютер не сможет использовать дополнительные возможности подключения, предоставляемые этими технологиями.",
    "explained": "Служба, необходимая в случаях, когда ваша сеть настроена по протоколу IPv6.",
    "recommendation": "Учитывая следующее:\nУ вас обычный провайдер, обычная сеть, стандартный протокол IPv4\nВы не используете Xbox\nСлужбу можно отключить."
  },
  "NcbService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d0%be%d1%81%d1%80%d0%b5%d0%b4%d0%bd%d0%b8%d0%ba-%d0%bf%d0%be%d0%b4%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d0%b9-%d0%ba-%d1%81%d0%b5%d1%82%d0%b8",
    "description": "Подключения к посредникам, позволяющие приложениям Магазина Windows получать уведомления из Интернета.",
    "explained": "Служба, необходимая для уведомлений приложений из Магазина Windows.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь Магазином Windows\nили вам не нужны уведомления от приложений Магазина Windows\nЕсли вы не пользуетесь Bluetooth\nМожете отключить службу.Однако следует помнить, если вы планируете подключать беспроводные устройства, службу нельзя отключать, потому что отключение службы приведёт к отключению Службы платформы подключенных устройств, от которой, в свою очередь, зависит процесс обнаружения беспроводных устройств, таких как Bluetooth-наушники, колонки, мониторы и прочие беспроводные гаджеты. Отключение зависимой службы приведёт к ошибке при попытке найти беспроводное устройство."
  },
  "mpssvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b1%d1%80%d0%b0%d0%bd%d0%b4%d0%bc%d0%b0%d1%83%d1%8d%d1%80-%d0%b7%d0%b0%d1%89%d0%b8%d1%82%d0%bd%d0%b8%d0%ba%d0%b0-windows",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "MSDTC": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%ba%d0%be%d0%be%d1%80%d0%b4%d0%b8%d0%bd%d0%b0%d1%82%d0%be%d1%80-%d1%82%d1%80%d0%b0%d0%bd%d0%b7%d0%b0%d0%ba%d1%86%d0%b8%d0%b9-msdtc",
    "description": "Координация транзакций, охватывающих несколько диспетчеров ресурсов, таких как базы данных, очереди сообщений и файловые системы. Если остановить данную службу, то такие транзакции будут выполняться с ошибкой. Если данная служба отключена, то запуск любых явно зависящих от нее служб станет невозможен.",
    "explained": "Служба, работающая на серверных компьютерах, отвечающая за корректную и актуальную информацию в общей базе данных.",
    "recommendation": "Учитывая следующее:\nЕсли у вас один домашний компьютер\nили простая локальная сеть без специальной корпоративной базы данных\nСлужбу можно отключить."
  },
  "GoogleUpdaterInternalService130.0.6679.0": {
    "error": true,
    "message": "Not found"
  },
  "FrameServer": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%b5%d1%80%d0%b2%d0%b5%d1%80-%d0%ba%d0%b0%d0%b4%d1%80%d0%be%d0%b2-%d0%ba%d0%b0%d0%bc%d0%b5%d1%80%d1%8b-windows",
    "description": "Позволяет нескольким клиентам получать доступ к видеокадрам с устройств, оснащенных камерой.",
    "explained": "Служба, позволяющая использовать веб-камеру компьютера не напрямую, а через запрос службы. Если PotPlayer, к примеру, может получить доступ к устройствам компьютера, то расширения браузера, такие как Discord, не могут. Поэтому необходима служба, отвечающая на запрос к подключению к веб-камере.",
    "recommendation": "Учитывая следующее:\nЕсли вы нигде и никогда не используете веб-камеру\nМожете отключить службу."
  },
  "GoogleUpdaterService134.0.6985.0": {
    "error": true,
    "message": "Not found"
  },
  "LanmanWorkstation": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%80%d0%b0%d0%b1%d0%be%d1%87%d0%b0%d1%8f-%d1%81%d1%82%d0%b0%d0%bd%d1%86%d0%b8%d1%8f",
    "description": "Создает и поддерживает клиентские сетевые подключения к удаленным серверам по протоколу SMB. Если данная служба будет остановлена, эти подключения станут недоступными. Если данная служба отключена, все явно зависящие от нее службы запустить не удастся.",
    "explained": "Основная служба SMB-протокола, позволяющая находить компьютеры локальной сети. Также является брокером при использовании Программы архивации данных.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь локальной сетью\nЕсли вы не используете встроенную в Windows Программу архивации данных\nЕсли вы не используете AMD Ryzen Master\nМожете отключить службу.\nЕсли вы пользуетесь локальной сетью даже без SMB-протокола\nЕсли иногда возникает ошибка 0x800704b3\nСлужбу нельзя отключать.\nОтключение службы приведёт к остановке службы Браузер компьютеров, которая нужна для отображения сетевых компьютеров в Проводнике Windows, а также к невозможности создать образ системы с помощью Программы архивации данных (ошибка архивации)."
  },
  "EventLog": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%b6%d1%83%d1%80%d0%bd%d0%b0%d0%bb-%d1%81%d0%be%d0%b1%d1%8b%d1%82%d0%b8%d0%b9-windows",
    "description": "Эта служба управляет событиями и журналами событий. Она поддерживает регистрацию и запрос событий, подписку на события, архивацию журналов и управление метаданными событий. События могут отображаться в формате XML и текстовом формате. Остановка этой службы может снизить безопасность и надежность системы.",
    "explained": "Служба, регистрирующая все события, происходящие в Windows. С помощью этой службы многие другие службы и программы получают актуальные сведения о сбоях программ, сбоях в системе безопасности и прочем. В случае несовместимости программ, ошибок и прочих событий, с помощью Журнала событий Windows, можно выяснить точно, что пошло не так и что с этим делать.",
    "recommendation": "Учитывая следующее:\nОт этой службы зависит корректная работа всей Windows\nОт этой службы зависят десятки других служб\nСлужбу нельзя отключать.Если вы отключите эту службу, перестанут работать её зависимости. Даже если вы просто остановите эту службу на время, то отвалится Служба сведений о подключенных сетях, из-за которой отвалится Служба списка сетей, что приведёт к отключению службы Автоматическая настройка сетевых устройств."
  },
  "Audiosrv": {
    "url": "https://win10tweaker.ru/twikinarium/services/windows-audio",
    "description": "Управление средствами работы со звуком для программ Windows. Если эта служба остановлена, то аудиоустройства и эффекты не будут правильно работать. Если данная служба отключена, то будет невозможно запустить все явно зависящие от нее службы.",
    "explained": "Служба нужна для того, чтобы у вас был звук.",
    "recommendation": "Учитывая следующее:\nЕсли у вас есть слух\nНе рекомендуется трогать эту службу. Отключение этой службы приведёт к отключению всех звуковых устройств Windows. Обратное включение вернёт всё обратно."
  },
  "InstallService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d1%81%d1%82%d0%b0%d0%bd%d0%be%d0%b2%d0%ba%d0%b8-microsoft-store",
    "description": "Обеспечивает поддержку инфраструктуры для Microsoft Store. Эта служба запускается по требованию и если она отключена, то установка не будет функционировать должным образом.",
    "explained": "Служба, отвечающая за соединение Магазина Windows с серверами Microsoft.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь Магазином Windows\nМожете отключить службу.\nЕсли пользуетесь Магазином и отключите службу, то получите ошибку Повторите попытку позже."
  },
  "DcomLaunch": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bc%d0%be%d0%b4%d1%83%d0%bb%d1%8c-%d0%b7%d0%b0%d0%bf%d1%83%d1%81%d0%ba%d0%b0-%d0%bf%d1%80%d0%be%d1%86%d0%b5%d1%81%d1%81%d0%be%d0%b2-dcom-%d1%81%d0%b5%d1%80%d0%b2%d0%b5%d1%80%d0%b0",
    "description": "Служба DCOMLAUNCH запускает COM- и DCOM-серверы в ответ на запросы активации объектов. Если отключить или остановить эту службу, то программы, использующие COM или DCOM, будут работать неправильно. Отключать службу DCOMLAUNCH не рекомендуется.",
    "explained": "Служба, отвечающая за все связи всех компонентов Windows.",
    "recommendation": "Учитывая следующее:\nОт службы зависят все компоненты Windows\nОт службы зависят все службы Windows\nСлужбу нельзя отключать.\nОтключение службы приведёт к отключению всех служб Windows, что в свою очередь выведет из строя всю Windows и вы не сможете загрузиться на Рабочий стол."
  },
  "DPS": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-%d1%83%d0%b4%d0%b0%d0%bb%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d1%80%d0%b0%d0%b1%d0%be%d1%87%d0%b8%d1%85-%d1%81%d1%82%d0%be%d0%bb%d0%be%d0%b2",
    "description": "Разрешает пользователям интерактивное подключение к удаленному компьютеру. Удаленный рабочий стол и сервер, обслуживающий сеансы подключения к удаленному рабочему столу, зависят от данной службы. Чтобы запретить удаленное использование данного компьютера, необходимо открыть панель управления, дважды щелкнуть компонент \"Свойства системы\" и затем на вкладке \"Удаленный доступ\" снять соответствующие флажки.",
    "explained": "Главная служба, отвечающая за удалённое управление рабочим столом.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь удалённым рабочим столом\nили пользуетесь, но подключаться будете только вы (не нужно, чтобы к вам)\nМожете отключить службу.\nЭто также отключит Перенаправитель портов, который вашему главному компьютеру тоже ни к чему."
  },
  "BthAvctpSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-avctp",
    "description": "Это служба протокола транспортировки управления аудио и видео",
    "explained": "Это заплатка для службы Bluetooth, которая контролирует корректное изменение громкости без прерываний звука. Одной службы мало, нужен костыль, чтобы всё работало правильно.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете Bluetooth и не планируете использовать Bluetooth-устройства\nМожете отключить службу."
  },
  "defragsvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%be%d0%bf%d1%82%d0%b8%d0%bc%d0%b8%d0%b7%d0%b0%d1%86%d0%b8%d1%8f-%d0%b4%d0%b8%d1%81%d0%ba%d0%be%d0%b2",
    "description": "Помогает компьютеру работать более эффективно за счет оптимизации файлов на запоминающих устройствах.",
    "explained": "Служба, отвечающая за дефрагментацию HDD (жёстких дисков) и оптимизацию SSD (твёрдотельных накопителей).",
    "recommendation": "Учитывая следующее:\nСлужба продлевает жизнь HDD / SHDD / SSD\nСлужба запускается только на время дефрагментации / оптимизации\nСлужбу нельзя отключать."
  },
  "DisplayEnhancementService": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%bb%d1%83%d1%87%d1%88%d0%b5%d0%bd%d0%b8%d1%8f-%d0%be%d1%82%d0%be%d0%b1%d1%80%d0%b0%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Служба для управления улучшением отображения (например, регулировка яркости).",
    "explained": "Служба, сделанная специально для ноутбуков и планшетов, где яркость дисплея нельзя отрегулировать отдельно на дисплее – только программно и только с помощью клавиш посылаемых в Windows, а не на сам экран.",
    "recommendation": "Учитывая следующее:\nЕсли у вас настольный компьютер\nМожете отключить службу."
  },
  "netprofm": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%81%d0%bf%d0%b8%d1%81%d0%ba%d0%b0-%d1%81%d0%b5%d1%82%d0%b5%d0%b9",
    "description": "Not found",
    "explained": "Not found",
    "recommendation": "Not found"
  },
  "NetTcpPortSharing": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%be%d0%b1%d1%89%d0%b5%d0%b3%d0%be-%d0%b4%d0%be%d1%81%d1%82%d1%83%d0%bf%d0%b0-%d0%ba-%d0%bf%d0%be%d1%80%d1%82%d0%b0%d0%bc-net-tcp",
    "description": "Предоставляет возможность совместного использования TCP-портов по протоколу Net.Tcp.",
    "explained": "Служба, позволяющая использовать нескольким программам один TCP-порт во время сетевого подключения.",
    "recommendation": "Учитывая следующее:\nСлужба отключена по умолчанию\nСлужбу можно не трогать и оставить на Отключена."
  },
  "DispBrokerDesktopSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%bf%d0%be%d0%bb%d0%b8%d1%82%d0%b8%d0%ba%d0%b8-%d0%be%d1%82%d0%be%d0%b1%d1%80%d0%b0%d0%b6%d0%b5%d0%bd%d0%b8%d1%8f",
    "description": "Управление подключением и конфигурацией локальных и удаленных дисплеев",
    "explained": "Служба, поддерживающая работу мониторов, подключённых удалённо.",
    "recommendation": "Учитывая следующее:\nЕсли у вас 1 монитор\nЕсли все ваши мониторы подключены локально\nМожете отключить службу."
  },
  "Dhcp": {
    "url": "https://win10tweaker.ru/twikinarium/services/dhcp-%d0%ba%d0%bb%d0%b8%d0%b5%d0%bd%d1%82",
    "description": "Регистрирует и обновляет IP-адреса и DNS-записи для этого компьютера. Если данная служба остановлена, этот компьютер не сможет получать динамические IP-адреса и выполнять обновления DNS. Если эта служба отключена, любые службы, которые явно зависят от нее, не могут быть запущены.",
    "explained": "Эта служба нужна для того, чтобы присваивать IP-адреса сетевым устройствам, подключённым к вашему компьютеру, включая сам компьютер. Например, вы подключаете роутер, а ваш компьютер уже знает, что доступ к нему будет по адресу 192.168.0.2, и знает он это благодаря тому, что у вас уже есть, к примеру, Wi-Fi станция, у которой IP-адрес 192.168.0.1 и т.д. и т.п., во избежание конфликтов IP-адресов в локальной сети. Все IP-адреса DHCP-клиент прописывает автоматически, если само устройство строго не указывает на другие параметры.",
    "recommendation": "Учитывая следующее:\nСлужба имеет зависимости\nСама зависит от других сетевых служб\nПо умолчанию тип запуска установлен на Автоматически\nЕсли вы отключите службу, и у вас, к примеру, есть только один роутер, и больше ничего подключать никогда не будете, то в свойствах подключения вам придётся указать явный IP-адрес роутера. Таким же образом придётся делать для каждого устройства и каждой виртуальной сети. Поэтому, чтобы не крутить себе и компьютеру мозги, лучше не трогать эту службу, а дать ей делать своё дело. Работает она только как конфигуратор и не жрёт ресурсы компьютера в фоне."
  },
  "EapHost": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%80%d0%b0%d1%81%d1%88%d0%b8%d1%80%d1%8f%d0%b5%d0%bc%d1%8b%d0%b9-%d0%bf%d1%80%d0%be%d1%82%d0%be%d0%ba%d0%be%d0%bb-%d0%bf%d1%80%d0%be%d0%b2%d0%b5%d1%80%d0%ba%d0%b8-eap",
    "description": "Служба расширяемого протокола проверки подлинности (EAP) обеспечивает проверку подлинности в сети в таких сценариях, как 802.1x (проводные и беспроводные сети), VPN и защита сетевого доступа (NAP). EAP также обеспечивает поддержку API-интерфейсов, используемых клиентами доступа к сети, такими как беспроводной клиент и VPN-клиент, в процессе проверки подлинности. Если эта служба отключена, компьютеру не удастся получить доступ к сетям, требующим проверку подлинности EAP.",
    "explained": "Служба, позволяющая настроить удалённый доступ не просто по паролю, а по USB-токену или смарт-карте, по отпечатку или распознаванию лица и т.д.",
    "recommendation": "Учитывая следующее:\nЕсли вы не используете удалённый доступ или Общий доступ\nлибо используете по паролю / без пароля и вам этого достаточно\nМожете отключить службу."
  },
  "dot3svc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%bf%d1%80%d0%be%d0%b2%d0%be%d0%b4%d0%bd%d0%b0%d1%8f-%d0%b0%d0%b2%d1%82%d0%be%d0%bd%d0%b0%d1%81%d1%82%d1%80%d0%be%d0%b9%d0%ba%d0%b0",
    "description": "Служба Wired AutoConfig (DOT3SVC) отвечает за проверку подлинности IEEE 802.1X интерфейсов Ethernet. Если текущее развертывание проводных сетей использует проверку подлинности 802.1X, необходимо настроить службу DOT3SVC для возможности подключения уровня 2 и предоставления доступа к сетевым ресурсам. На проводные сети, не использующие проверку подлинности 802.1X, служба DOT3SVC не влияет.",
    "explained": "Служба, контролирующая доступ в сеть тех компьютеров проводной локальной сети, которые нужно ограничивать. Используется в учебных заведениях и корпорациях, где настроена проводная сеть и бывает нужно отрубить доступ некоторым компам, без извлечения кабеля (без физического отключения компьютера от сети).",
    "recommendation": "Учитывая следующее:\nЕсли у вас нет локальной сети\nЛибо ваша локальная сеть беспроводная\nЛибо вы никого не ограничиваете в своей проводной сети и не собираетесь ограничивать\nСлужбу можно отключить."
  },
  "EFS": {
    "url": "https://win10tweaker.ru/twikinarium/services/efs",
    "description": "Предоставляет основную технологию шифрования, которая используется для хранения зашифрованных файлов в томах файловой системы NTFS. Если эта служба остановлена или отключена, доступ приложений к зашифрованным файлам не обеспечивается.",
    "explained": "Служба, обеспечивающая шифрование данных. В отличие от BitLocker, служба EFS шифрует не весь диск, а выбранные файлы и папки. Также эта служба помогает шифровать данные буфера обмена, используемые по Win+V.",
    "recommendation": "Учитывая следующее:\nСлужба тормозит работу системы, если вы не используете шифрование\nСлужба тормозит работу системы при чтении зашифрованных данных\nСлужба нужна для использования буфера по Win+V\nМожете отключить службу."
  },
  "BFE": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b1%d0%b0%d0%b7%d0%be%d0%b2%d0%be%d0%b9-%d1%84%d0%b8%d0%bb%d1%8c%d1%82%d1%80%d0%b0%d1%86%d0%b8%d0%b8",
    "description": "Служба базовой фильтрации (BFE) представляет собой службу, которая управляет политиками брандмауэра и политиками IP-безопасности (IPsec), применяя фильтрацию пользовательских режимов. Остановка или отключение службы BFE значительно снижает уровень безопасности системы. Это также приводит к непредсказуемым действиям при управлении IPsec и работе приложений брандмауэра.",
    "explained": "Основная служба для управления политикой сетевой безопасности.",
    "recommendation": "Учитывая следующее:\nОт этой службы зависят довольно многие службы, но что самое главное – Брандмауэр Защитника Windows\nНе желательно отключать эту службу.Только, если вы на 100% уверены, что Брандмауэр вам не нужен и никогда не понадобится. В противном случае, при попытке доступа к Брандмауэру, вы поймаете ошибку 0x8007042c."
  },
  "CryptSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%8b-%d0%ba%d1%80%d0%b8%d0%bf%d1%82%d0%be%d0%b3%d1%80%d0%b0%d1%84%d0%b8%d0%b8",
    "description": "Предоставляет три службы управления: службу баз данных каталога, которая подтверждает подписи файлов Windows и разрешает установку новых программ, службу защищенного корня, которая добавляет и удаляет сертификаты доверенного корневого центра сертификации с этого компьютера, и службу автоматического обновления корневых сертификатов, которая получает корневые сертификаты из центра обновления Windows и разрешает сценарии, такие как SSL. В случае остановки данной службы будет нарушена работа всех этих служб управления. В случае отключения данной службы будет невозможен запуск всех явно зависимых от нее служб.",
    "explained": "Служба, отвечающая за шифрование данных в операционной системе Windows. Не важно – программа что-то шифрует, которую вы написали или программа, скачанная из интернета, или сама Windows. Всё, что связано с шифрованием, требует наличия этой службы.",
    "recommendation": "Учитывая следующее:\nОдна из самых полезных служб Windows за всё время\nСлужба запускается только в тех случаях, когда от неё что-то требуется\nСлужбу нельзя отключать.\nЕсли вы отключите эту службу, то к примеру запуск Win 10 Tweaker автоматически запустит эту службу. Строго говоря запускает её не Win 10 Tweaker и не программы, а сама Windows, в недрах которой заложено автоматическое исправление и запуск этой службы, в случаях, когда любое ПО пытается что-то сделать, связанное с криптографией. Win 10 Tweaker, например, защищает таким образом ваш личный код активации, Acronis Active Protection шифрует (защищает) ваши данные от несанкционированного доступа и т.д."
  },
  "UsoSvc": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d0%be%d0%b1%d0%bd%d0%be%d0%b2%d0%b8%d1%82%d1%8c-%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d1%83-%d0%be%d1%80%d0%ba%d0%b5%d1%81%d1%82%d1%80%d0%b0%d1%82%d0%be%d1%80%d0%b0-usosvc",
    "description": "Управляет обновлениями Windows. Если она остановлена, ваши устройства не смогут загружать и устанавливать последние обновления.",
    "explained": "Служба, управляющая пакетами обновлений Windows. При попытках остановить или отключить эту службу, Windows переименовывает её из Обновить службу оркестратора в Служба оркестратора обновлений, а при смене приоритета раскладки клавиатуры, служба принимает имя Update Orchestrator Service. Всё это сделано для того, чтобы сбить с толку пользователя и принудительно ставить обновления.",
    "recommendation": "Учитывая следующее:\nЕсли вы опытный пользователь и вы не устанавливаете обновления Windows\nМожете отключить службу. Конечно же, она снова сама себя запустит благодаря своему медику, поэтому лучше отключать эту службу в Win 10 Tweaker."
  },
  "WEPHOSTSVC": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d1%83%d0%b7%d0%bb%d0%b0-%d0%bf%d0%be%d1%81%d1%82%d0%b0%d0%b2%d1%89%d0%b8%d0%ba%d0%b0-%d1%88%d0%b8%d1%84%d1%80%d0%be%d0%b2%d0%b0%d0%bd%d0%b8%d1%8f-windows",
    "description": "Служба узла поставщика шифрования Windows является брокером между функциями шифрования, предоставляемыми сторонними поставщиками, и процессами, которым требуется оценивать и применять политики EAS. При остановке этой службы станут недействительными проверки соответствия EAS, которые были установлены подключенными учетными записями почты",
    "explained": "Служба-посредник между плиточными приложениями и серверами Microsoft. Служат для дополнительной проверки \"легитимности\" самой синхронизации, если вы её используете.",
    "recommendation": "Учитывая следующее:\nСлужба мёртворождённая и не используется\nМожете отключить службу.\nОтключение службы, довольно редко, но, будет писать ошибки в Журнале событий Windows о том, что службу не удалось запустить."
  },
  "DialogBlockingService": {
    "url": "https://win10tweaker.ru/twikinarium/services/dialogblockingservice",
    "description": "Служба блокировки диалогового окна",
    "explained": "Служба, появившаяся, как недоразумение в новых версиях Windows 10 и 11, необходимая для расширенных параметров для настроек «Режим блокировки устройства» и именно в старых интерфейсах. Microsoft создала службу для предыдущих версий, потом надобность в этой службе пропала и старых параметров уже нет, но служба наоборот появилась.",
    "recommendation": "Учитывая следующее:\nСлужба является ошибкой Microsoft\nСлужбу можно оставить отключённой."
  },
  "AudioEndpointBuilder": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d1%80%d0%b5%d0%b4%d1%81%d1%82%d0%b2%d0%be-%d0%ba%d0%be%d0%bd%d0%b5%d1%87%d0%bd%d1%8b%d1%85-%d1%82%d0%be%d1%87%d0%b5%d0%ba-windows-audio",
    "description": "Управление звуковыми устройствами для службы Windows Audio. Если эта служба остановлена, то звуковые устройства и эффекты не будут правильно работать. Если данная служба отключена, все явно зависящие от нее службы запустить не удастся",
    "explained": "Служба, отвечающая за настройки всех звуковых устройств на вашем компьютере.",
    "recommendation": "Учитывая следующее:\nЕсли у вас есть слух\nНе рекомендуется отключать эту службу.\nОтключение этой службы приведёт к отключению всех звуковых устройств Windows. Обратное включение вернёт всё обратно, но не запустит Windows Audio. Это вам придётся делать самостоятельно."
  },
  "vmicvss": {
    "url": "https://win10tweaker.ru/twikinarium/services/%d1%81%d0%bb%d1%83%d0%b6%d0%b1%d0%b0-%d0%b7%d0%b0%d0%bf%d1%80%d0%be%d1%81%d0%be%d0%b2-hyper-v",
    "description": "Согласовывает обмен данными, необходимыми при использовании службы теневого копирования томов для резервного копирования приложений и данных на этой виртуальной машине с операционной системы физического компьютера.",
    "explained": "Служба, которая использует Теневое копирование основного компьютера для виртуального. Необходим виртуальным машинам Microsoft, чтобы не нагружать виртуалку.",
    "recommendation": "Учитывая следующее:\nЕсли вы не пользуетесь виртуальными машинами Microsoft. \nМожете отключить службу."
  }
}